[
  {
    "name": "BRK",
    "children": [
      {
        "name": "MCBooster",
        "children": [
          {
            "name": "HydESPModel",
            "children": [
              {
                "name": "AccumulatorMaxPressure",
                "tooltip": "Pressure above which the volume of low pressure accumulator is maximal. Parameter needed for CarMaker hydraulic ESC (Name: 'LPA.pMax')."
              },
              {
                "name": "AccumulatorMinPressure",
                "tooltip": "Pressure below which the volume of low pressure accumulator is minimal. Parameter needed for CarMaker hydraulic ESC (Name: 'LPA.pMin')."
              },
              {
                "name": "AccumulatorMaxVolume",
                "tooltip": "Maximum volume of low pressure accumulator units. Parameter needed for CarMaker hydraulic ESC (Name: 'LPA.vMax')."
              },
              {
                "name": "PumpAccConstant",
                "tooltip": "Time constant when hydraulic pump is accelerating. Value is set as duration it takes from switching on pump to reaching 63% of full flow. Parameter needed for CarMaker hydraulic ESC (Name: 'Pump.Full')."
              },
              {
                "name": "PumpLossCoefficient",
                "tooltip": "Loss coefficient of the two hydraulic pumps (each responsible for one circuit). Parameter needed for CarMaker hydraulic ESC (Name: 'Pump.cLoss')."
              },
              {
                "name": "PumpDecConstant",
                "tooltip": "Time constant when hydraulic pump is decelerating. Parameter needed for CarMaker hydraulic ESC (Name: 'Pump.Zero')."
              },
              {
                "name": "PumpMaxDelivery",
                "tooltip": "Maximum delivery of the two hydraulic pumps (each responsible for one circuit) at 0 bar pressure difference. Parameter needed for CarMaker hydraulic ESC (Name: 'Pump.qMax')."
              },
              {
                "name": "AttenuatorVolume",
                "tooltip": "Suction line volume at the low pressure side of the hydraulic pump. Parameter needed for CarMaker hydraulic ESC (Name: 'Att.dp2dv')."
              },
              {
                "name": "PumpMaxVoltage",
                "tooltip": "Generated voltage of the hydraulic pump at maximum rotational speed. Parameter needed for CarMaker hydraulic ESC (Name: 'Pump.genVmax')."
              },
              {
                "name": "PumpPressureThreshold",
                "tooltip": "The hydraulic pump is only working if this value is surpassed. Parameter needed for CarMaker hydraulic ESC (Name: 'Pump.pEdge')."
              },
              {
                "name": "PumpSaturationPressure",
                "tooltip": "At this pressure the pump operates at 63% of its full delivery capacity. Parameter needed for CarMaker hydraulic ESC (Name: 'Pump.p63Prcnt')."
              },
              {
                "name": "SuctionLineVolume",
                "tooltip": "Suction line volume at the low pressure side of the hydraulic pump. Parameter needed for CarMaker hydraulic ESC (Name: 'SuppL.dp2dv')."
              }
            ]
          },
          {
            "name": "Front",
            "children": [
              {
                "name": "HydESPModel",
                "children": [
                  {
                    "name": "PressureVolumeRatio1D",
                    "tooltip": "Volume of brake fluid absorbed by the 2 front wheel brake cylinders at a given pressure. Parameter needed for CarMaker hydraulic ESC (Name: 'Cyl_f.pv.mapping')."
                  }
                ]
              },
              {
                "name": "TorquePressureRatio",
                "tooltip": "Describes the ratio between the pressure in the master cylinder and the brake torque applied to each wheel on the front axis."
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "TorquePressureRatio",
                "tooltip": "Describes the brake torque applied to each wheel if the park brake is activated on the rear axis."
              },
              {
                "name": "HydESPModel",
                "children": [
                  {
                    "name": "PressureVolumeRatio1D",
                    "tooltip": "Volume of brake fluid absorbed by the 2 rear wheel brake cylinders at a given pressure. Parameter needed for CarMaker hydraulic ESC (Name: 'Cyl_r.pv.mapping')."
                  }
                ]
              }
            ]
          },
          {
            "name": "Amplification",
            "tooltip": "Brake booster amplification ratio.Build up the precharge force of the springs in the master cylinder has to be overcome first. Parameter needed for CarMaker hydraulic ESC (Name: 'Boo.ampli')."
          },
          {
            "name": "BoreTravel",
            "tooltip": "Piston travel to close compensation bore inside master cylinder. Parameter needed for CarMaker hydraulic ESC (Name: 'MC.xCompBore')."
          },
          {
            "name": "BuildUpTime",
            "tooltip": "Period of time from the beginning of the building of brake pressure until it reaches 75% of the desired value"
          },
          {
            "name": "RunOutPressure",
            "tooltip": "Brake booster run-out pressure. Above the run-out pressure the booster amplification is one irregardlessly of input force. Parameter needed for CarMaker hydraulic ESC (Name: 'Boo.runOut')."
          },
          {
            "name": "PressureForceRatio",
            "tooltip": "This is the ratio of brake pedal force to the corresponding pressure in the master cylinder."
          },
          {
            "name": "SpringConstant",
            "tooltip": "Master cylinder spring constant. If MC is equipped with more than one spring, same value will be used for every spring. Parameter needed for CarMaker hydraulic ESC (Name: 'MC.springConst')."
          },
          {
            "name": "SpringPrecharge",
            "tooltip": "Precharge of master cylinder spring. If MC is equipped with more than one spring, same value will be used for every spring. Parameter needed for CarMaker hydraulic ESC (Name: 'MC.spring Load')."
          },
          {
            "name": "PistonArea",
            "tooltip": "Area of master cylinder piston. Parameter needed for CarMaker hydraulic ESC (Name: 'MC.area')."
          }
        ]
      },
      {
        "name": "ParkBrake",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Torque",
                "tooltip": "Describes the brake torque applied to each wheel if the park brake is activated on the front axis."
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "Torque",
                "tooltip": "Describe the ratio between the pressure in the master cylinder and the brake torque applied to each wheel on the rear axis."
              }
            ]
          }
        ]
      },
      {
        "name": "Pedal",
        "children": [
          {
            "name": "Ratio",
            "tooltip": "The pedal ratio amplifies the force of the brake pedal. Parameter needed for CarMaker hydraulic ESC (Name: 'Pedal.ratio')."
          },
          {
            "name": "ResponseTime",
            "tooltip": "Period of time from pressing the pedal till the brake pressure begins to build up."
          }
        ]
      },
      {
        "name": "BrakeLine",
        "children": [
          {
            "name": "HydESPModel",
            "children": [
              {
                "name": "Fluid1",
                "children": [
                  {
                    "name": "Temperature",
                    "tooltip": "First brake fluid reference temperature. Parameter needed for CarMaker hydraulic ESC (Name: 'Fluid.P1.Temp')."
                  },
                  {
                    "name": "Viscosity",
                    "tooltip": "First brake fluid reference viscosity. Parameter needed for CarMaker hydraulic ESC (Name: 'Fluid.P1.nue')."
                  }
                ]
              },
              {
                "name": "Fluid2",
                "children": [
                  {
                    "name": "Temperature",
                    "tooltip": "Second brake fluid reference temperature. Parameter needed for CarMaker hydraulic ESC (Name: 'Fluid.P2.Temp')."
                  },
                  {
                    "name": "Viscosity",
                    "tooltip": "Second brake fluid reference viscosity. Parameter needed for CarMaker hydraulic ESC (Name: 'Fluid.P2.nue')."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "Caliper",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "HydESPModel",
                "children": [
                  {
                    "name": "BrakeRadius",
                    "tooltip": "Effective front brake radii. Parameter needed for CarMaker hydraulic ESC (Name: 'Pist_f.rBrake')."
                  },
                  {
                    "name": "PistonsArea",
                    "tooltip": "Total effective area of the ensemble of brake cylinders of one side (outboard or inboard) of front brake pistons of a single brake. Parameter needed for CarMaker hydraulic ESC (Name: 'Pist_f.area')."
                  }
                ]
              },
              {
                "name": "Left",
                "children": [
                  {
                    "name": "HydESPModel",
                    "children": [
                      {
                        "name": "ForceRatio",
                        "tooltip": "Ratio of braking force to actuating force (front left). Parameter takes into account the influence of the internal transmission ratio of the brake as well as the Coulomb friction coefficient. Parameter needed for CarMaker hydraulic ESC (Name: 'Pist_fl.ratio')."
                      }
                    ]
                  }
                ]
              },
              {
                "name": "Right",
                "children": [
                  {
                    "name": "HydESPModel",
                    "children": [
                      {
                        "name": "ForceRatio",
                        "tooltip": "Ratio of braking force to actuating force (front right). Parameter takes into account the influence of the internal transmission ratio of the brake as well as the Coulomb friction coefficient. Parameter needed for CarMaker hydraulic ESC (Name: 'Pist_fr.ratio')."
                      }
                    ]
                  }
                ]
              },
              {
                "name": "Mass",
                "tooltip": "Brake caliper mass front"
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "Mass",
                "tooltip": "Brake caliper mass rear"
              },
              {
                "name": "HydESPModel",
                "children": [
                  {
                    "name": "BrakeRadius",
                    "tooltip": "Effective rear brake radii. Parameter needed for CarMaker hydraulic ESC (Name: 'Pist_r.rBrake')."
                  },
                  {
                    "name": "PistonsArea",
                    "tooltip": "Total effective area of the ensemble of brake cylinders of one side (outboard or inboard) of rear brake pistons of a single brake. Parameter needed for CarMaker hydraulic ESC (Name: 'Pist_r.area')."
                  }
                ]
              },
              {
                "name": "Left",
                "children": [
                  {
                    "name": "HydESPModel",
                    "children": [
                      {
                        "name": "ForceRatio",
                        "tooltip": "Ratio of braking force to actuating force (rear left). Parameter takes into account the influence of the internal transmission ratio of the brake as well as the Coulomb friction coefficient. Parameter needed for CarMaker hydraulic ESC (Name: 'Pist_rl.ratio')."
                      }
                    ]
                  }
                ]
              },
              {
                "name": "Right",
                "children": [
                  {
                    "name": "HydESPModel",
                    "children": [
                      {
                        "name": "ForceRatio",
                        "tooltip": "Ratio of braking force to actuating force (rear right). Parameter takes into account the influence of the internal transmission ratio of the brake as well as the Coulomb friction coefficient. Parameter needed for CarMaker hydraulic ESC (Name: 'Pist_rr.ratio')."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "Disk",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Mass",
                "tooltip": "Brake disk mass front"
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "Mass",
                "tooltip": "Brake disk mass rear"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "name": "AER",
    "children": [
      {
        "name": "ConsiderationPointPosition",
        "tooltip": "When the vehicle is gripped by side wind, the wind starts to take effect only from a certain point on, e.g. if only the bumper is attacked by side wind the driver will usually not recognize the effects. Ahead of this point, the vehicle body does not offer enough contact surface to the wind to take effect."
      },
      {
        "name": "PitchTorqueCoefficient1D",
        "tooltip": "Aerodynamical pitch torque coefficent as a function of wind angle of attack (tau)"
      },
      {
        "name": "ReferenceLength",
        "tooltip": "This is the length between VEHICLE.AERODYNAMIC.CONSIDERATION POINT XYZ and the vehicle's rearmost point. It is used to calculate the torques applied to VEHICLE.AERODYNAMIC.RESULTANT FORCE POINT XYZ"
      },
      {
        "name": "ResultantForcePosition",
        "tooltip": "Reference point at which resultant force is acting. It is the center of pressure, the point where the aerodynamic forces, including the side wind forces, are applied."
      },
      {
        "name": "RollTorqueCoefficient1D",
        "tooltip": "Aerodynamical roll torque coefficent as a function of wind angle of attack (tau)"
      },
      {
        "name": "YawTorqueCoefficient1D",
        "tooltip": "Aerodynamical yaw torque coefficent as a function of wind angle of attack (tau)"
      },
      {
        "name": "SideForceCoefficient1D",
        "tooltip": "Aerodynamical side force coefficient as a function of wind angle of attack (tau)"
      },
      {
        "name": "LiftForceCoefficient1D",
        "tooltip": "Lift force coefficient as a function of wind angle of attack (tau)"
      },
      {
        "name": "DragCoefficient1D",
        "tooltip": "Defines the drag coefficient of the entire vehicle as a function of wind angle of attack (tau)"
      },
      {
        "name": "FrontalArea",
        "tooltip": "The vehicle reference area is the projected frontal area including tires and underbody parts"
      }
    ]
  },
  {
    "name": "ELE",
    "children": [
      {
        "name": "Battery",
        "children": [
          {
            "name": "DCDCConverter",
            "children": [
              {
                "name": "HV1HV2",
                "children": [
                  {
                    "name": "Efficiency",
                    "tooltip": "The efficiency of the DC/DC converter. The normalized electric power vs normalized efficiency. (Power from High Voltage 1 to High Voltage 2 divided by the DC/DC maximum power from 1 to 0)"
                  },
                  {
                    "name": "Efficiency1D",
                    "tooltip": "The efficiency of the DC/DC converter in a table. The normalized electric power vs normalized efficiency. (Power from High Voltage 1 to High Voltage 2 divided by the DC/DC maximum power from 1 to 0)"
                  },
                  {
                    "name": "MaxPower",
                    "tooltip": "Maximum electric power that can pass the DC/DC converter"
                  },
                  {
                    "name": "Ratio",
                    "tooltip": "This is the voltage multiplication factor between 2 battery high voltage circuits. (The larger high voltage cirucit is divided with the smaller high voltage circuit)"
                  }
                ]
              },
              {
                "name": "HV1LV",
                "children": [
                  {
                    "name": "Efficiency",
                    "tooltip": "The efficiency of the DC/DC converter. The normalized electric power vs normalized efficiency. (Power from High Voltage to Low Voltage divided by the DC/DC maximum power from 1 to 0)"
                  },
                  {
                    "name": "Efficiency1D",
                    "tooltip": "The efficiency of the DC/DC converter in a table. The normalized electric power vs normalized efficiency. (Power from High Voltage to Low Voltage divided by the DC/DC maximum power from 1 to 0)"
                  },
                  {
                    "name": "MaxPower",
                    "tooltip": "Maximum electric power that can pass the DC/DC converter"
                  }
                ]
              }
            ]
          },
          {
            "name": "HV",
            "children": [
              {
                "name": "AuxiliaryPower",
                "tooltip": "This parameter sets the initial electric power of auxiliary consumers for the high voltage battery"
              },
              {
                "name": "Capacity",
                "tooltip": "This is the total capacity of the board high voltage battery"
              },
              {
                "name": "InertiaTensor",
                "tooltip": "Moments of inertia of high voltage battery"
              },
              {
                "name": "Inertia",
                "tooltip": "Moment of inertia of EV Battery\r\r\n(Amesim paramter name: \"(EV) Battery MOI\")"
              },
              {
                "name": "Mass",
                "tooltip": "Mass of high voltage battery"
              },
              {
                "name": "InitialSOC",
                "tooltip": "This is the high voltage battery initial state of charge"
              },
              {
                "name": "MaxCurrent",
                "tooltip": "This is the high voltage battery maximum constant battery charge current"
              },
              {
                "name": "MaxPower",
                "tooltip": "This is the high voltage battery maximum constant battery charge power"
              },
              {
                "name": "MaxSOC",
                "tooltip": "This is the high voltage battery maximum state of charge"
              },
              {
                "name": "MinSOC",
                "tooltip": "This is the high voltage battery minimum state of charge"
              },
              {
                "name": "SOCFactor1D",
                "tooltip": "This is a 1D table considering a correctionf factor that defines the dependency of idle voltage from its state of charge"
              },
              {
                "name": "Position",
                "tooltip": "Position of high voltage battery in room (T L H)"
              },
              {
                "name": "Voltage",
                "tooltip": "Open circuit (idle) voltage of HV battery"
              },
              {
                "name": "BatteryManagement",
                "children": [
                  {
                    "name": "ChargeControl",
                    "children": [
                      {
                        "name": "IntegralValue",
                        "tooltip": "Integral controller value for high voltage battery charge controller"
                      }
                    ]
                  },
                  {
                    "name": "ConsumerControl",
                    "children": [
                      {
                        "name": "IntegralValue",
                        "tooltip": "Integral controller value for high voltage battery consumer controller"
                      }
                    ]
                  },
                  {
                    "name": "Generator",
                    "children": [
                      {
                        "name": "MaxPower",
                        "tooltip": "Maximum generator power for high voltage Battery Mangement"
                      }
                    ]
                  },
                  {
                    "name": "SOCTarget",
                    "tooltip": "Target SOC for high voltage battery"
                  }
                ]
              },
              {
                "name": "ChenModel",
                "children": [
                  {
                    "name": "C1",
                    "tooltip": "This is the total approximated high voltage electrical circuit capacity C1 for the Chen battery model parametrization"
                  },
                  {
                    "name": "C2",
                    "tooltip": "This is the total approximated high voltage electrical circuit capacity C2 for the Chen battery model parametrization"
                  },
                  {
                    "name": "R0",
                    "tooltip": "This is the total approximated high voltage electrical circuit resistance R0 for the Chen battery model parametrization"
                  },
                  {
                    "name": "R2",
                    "tooltip": "This is the total approximated high voltage electrical circuit resistance R2 for the Chen battery model parametrization"
                  },
                  {
                    "name": "R1",
                    "tooltip": "This is the total approximated high voltage electrical circuit resistance R1 for the Chen battery model parametrization"
                  }
                ]
              },
              {
                "name": "RC1",
                "children": [
                  {
                    "name": "SOC",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C1 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R1 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Temp",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C1 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R1 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Capacitor2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C1 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Capacitor",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C1 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R1 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R1 for the BattCEM battery model parametrization"
                  }
                ]
              },
              {
                "name": "RC2",
                "children": [
                  {
                    "name": "SOC",
                    "children": [
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R2 for the Chen battery model parametrization"
                      },
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C2 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Temp",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C2 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R2 for the Chen battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Capacitor",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C2 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R2 for the Chen battery model parametrization"
                  },
                  {
                    "name": "Resistance2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R2 for the Chen battery model parametrization"
                  },
                  {
                    "name": "Capacitor2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C2 for the BattCEM battery model parametrization"
                  }
                ]
              },
              {
                "name": "RC3",
                "children": [
                  {
                    "name": "SOC",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C3 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R3 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Temp",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C3 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R3 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Capacitor",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C3 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Capacitor2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C3 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R3 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R3 for the BattCEM battery model parametrization"
                  }
                ]
              },
              {
                "name": "RC4",
                "children": [
                  {
                    "name": "SOC",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C4 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R4 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Temp",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C4 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R4 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Capacitor",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C4 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Capacitor2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C4 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R4 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R4 for the BattCEM battery model parametrization"
                  }
                ]
              },
              {
                "name": "RC5",
                "children": [
                  {
                    "name": "SOC",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C5 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R5 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Temp",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C5 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R5 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Capacitor",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C5 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Capacitor2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C5 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R5 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R5 for the BattCEM battery model parametrization"
                  }
                ]
              },
              {
                "name": "Thermal",
                "children": [
                  {
                    "name": "Cth",
                    "tooltip": "This is the thermal capacity of the battery pack"
                  },
                  {
                    "name": "Rth",
                    "tooltip": "This is the thermal resistance of the of the underlying heat transfer"
                  },
                  {
                    "name": "TempCool",
                    "tooltip": "This is the coolant temperature"
                  }
                ]
              },
              {
                "name": "PackEnergy",
                "tooltip": "This is the battery pack energy"
              },
              {
                "name": "InitialTemperature",
                "tooltip": "This is the battery initial temperature."
              },
              {
                "name": "PackSizeParallel",
                "tooltip": "Number of parallel branches of the battery pack matrix"
              },
              {
                "name": "PackSizeSerial",
                "tooltip": "Number of serial cells/modules of the battery pack matrix"
              },
              {
                "name": "PackVoltage",
                "tooltip": "This is the battery pack voltage"
              }
            ]
          },
          {
            "name": "LV",
            "children": [
              {
                "name": "Capacity",
                "tooltip": "This is the total capacity of the board low voltage battery"
              },
              {
                "name": "AuxiliaryPower",
                "tooltip": "This parameter sets the initial electric power of auxiliary consumers for the low voltage battery"
              },
              {
                "name": "InitialSOC",
                "tooltip": "This is the low voltage battery initial state of charge"
              },
              {
                "name": "Mass",
                "tooltip": "Overall mass of a conventional power supply battery"
              },
              {
                "name": "MaxCurrent",
                "tooltip": "This is the low voltage battery maximum constant battery charge current"
              },
              {
                "name": "MaxPower",
                "tooltip": "This is the low voltage battery maximum constant battery charge power"
              },
              {
                "name": "MinSOC",
                "tooltip": "This is the low voltage battery minimum state of charge"
              },
              {
                "name": "MaxSOC",
                "tooltip": "This is the low voltage battery maximum state of charge"
              },
              {
                "name": "Position",
                "tooltip": "The postion (T L H) of a conventional power supply battery in the vehicle"
              },
              {
                "name": "SOCFactor1D",
                "tooltip": "This is a 1D table considering a correction factor that defines the dependency of idle voltage from its state of charge"
              },
              {
                "name": "BatteryManagement",
                "children": [
                  {
                    "name": "ChargeControl",
                    "children": [
                      {
                        "name": "IntegralValue",
                        "tooltip": "Integral controller value for low voltage battery charge controller"
                      }
                    ]
                  },
                  {
                    "name": "Generator",
                    "children": [
                      {
                        "name": "MaxPower",
                        "tooltip": "Maximum generator power for low voltage Battery Mangement"
                      }
                    ]
                  },
                  {
                    "name": "ConsumerControl",
                    "children": [
                      {
                        "name": "IntegralValue",
                        "tooltip": "Integral controller value for low voltage battery consumer controller"
                      }
                    ]
                  },
                  {
                    "name": "SOCTarget",
                    "tooltip": "Target SOC for low voltage battery"
                  }
                ]
              },
              {
                "name": "Voltage",
                "tooltip": "Open circuit (idle) voltage of LV battery"
              },
              {
                "name": "ChenModel",
                "children": [
                  {
                    "name": "C1",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C1 for the Chen battery model parametrization"
                  },
                  {
                    "name": "C2",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C2 for the Chen battery model parametrization"
                  },
                  {
                    "name": "R0",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R0 for the Chen battery model parametrization"
                  },
                  {
                    "name": "R1",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R1 for the Chen battery model parametrization"
                  },
                  {
                    "name": "R2",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R2 for the Chen battery model parametrization"
                  }
                ]
              },
              {
                "name": "RC1",
                "children": [
                  {
                    "name": "SOC",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C1 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R1 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Temp",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C1 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R1 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Capacitor",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C1 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Capacitor2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C1 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R1 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R1 for the BattCEM battery model parametrization"
                  }
                ]
              },
              {
                "name": "RC2",
                "children": [
                  {
                    "name": "SOC",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C2 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R2 for the Chen battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Temp",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C2 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R2 for the Chen battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Capacitor",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C2 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Capacitor2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C2 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R2 for the Chen battery model parametrization"
                  },
                  {
                    "name": "Resistance",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R2 for the Chen battery model parametrization"
                  }
                ]
              },
              {
                "name": "RC3",
                "children": [
                  {
                    "name": "SOC",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C3 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R3 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Temp",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C3 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R3 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Capacitor",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C3 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Capacitor2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C3 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R3 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R3 for the BattCEM battery model parametrization"
                  }
                ]
              },
              {
                "name": "RC4",
                "children": [
                  {
                    "name": "SOC",
                    "children": [
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R4 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C4 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Temp",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C4 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R4 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Capacitor",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C4 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Capacitor2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C4 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R4 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R4 for the BattCEM battery model parametrization"
                  }
                ]
              },
              {
                "name": "RC5",
                "children": [
                  {
                    "name": "SOC",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C5 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R5 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Temp",
                    "children": [
                      {
                        "name": "Capacitor1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit capacity C5 for the BattCEM battery model parametrization"
                      },
                      {
                        "name": "Resistance1D",
                        "tooltip": "This is the total approximated low voltage electrical circuit resistance R5 for the BattCEM battery model parametrization"
                      }
                    ]
                  },
                  {
                    "name": "Capacitor",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C5 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Capacitor2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit capacity C5 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R5 for the BattCEM battery model parametrization"
                  },
                  {
                    "name": "Resistance2D",
                    "tooltip": "This is the total approximated low voltage electrical circuit resistance R5 for the BattCEM battery model parametrization"
                  }
                ]
              },
              {
                "name": "Thermal",
                "children": [
                  {
                    "name": "Cth",
                    "tooltip": "This is the thermal capacity of the battery pack"
                  },
                  {
                    "name": "Rth",
                    "tooltip": "This is the thermal resistance of the of the underlying heat transfer"
                  },
                  {
                    "name": "TempCool",
                    "tooltip": "This is the coolant temperature"
                  }
                ]
              },
              {
                "name": "InertiaTensor",
                "tooltip": "Overall inertia tensors of a conventional power supply battery"
              },
              {
                "name": "InitialTemperature",
                "tooltip": "This is the battery initial temperature."
              },
              {
                "name": "PackEnergy",
                "tooltip": "This is the battery pack energy"
              },
              {
                "name": "PackSizeParallel",
                "tooltip": "Number of parallel branches of the battery pack matrix"
              },
              {
                "name": "PackVoltage",
                "tooltip": "This is the battery pack voltage"
              },
              {
                "name": "PackSizeSerial",
                "tooltip": "Number of serial cells/modules of the battery pack matrix"
              }
            ]
          }
        ]
      },
      {
        "name": "EMotor",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "BuildUpTime",
                "tooltip": "Describes the build up time of motor load. Period of time from pedal displacement until torque generation\r\r\n(For front wheel hubs, front driveshaft or front differential)"
              },
              {
                "name": "InertiaTensor",
                "tooltip": "Moments of inertia of electric motor\r\r\n(For front wheel hubs, front driveshaft or front differential)"
              },
              {
                "name": "FrictionTorqueCoefficient",
                "tooltip": "Gradient between friction torque and rot. speed difference between shafts. Equivalent to friction coefficient\r\r\n(For front wheel hubs, front driveshaft or front differential)"
              },
              {
                "name": "Mass",
                "tooltip": "Mass of electric motor\r\r\n(For front wheel hubs, front driveshaft or front differential)"
              },
              {
                "name": "Inertia",
                "tooltip": "Inertia of electric motor\r\r\n(For front wheel hubs, front driveshaft or front differential)"
              },
              {
                "name": "Position",
                "tooltip": "Position of electric motor in room (T L H)\r\r\n(For front wheel hubs, front driveshaft or front differential)"
              },
              {
                "name": "GearReducer",
                "children": [
                  {
                    "name": "Inertia",
                    "tooltip": "Inertia of motor reducer along reducer axis of an electric vehicle for the front\r\r\n(Amesim paramter name: \"(EV) Motor Reducer MOI\")"
                  },
                  {
                    "name": "Ratio",
                    "tooltip": "Transmission ratio of reducer gear (ratio electric motor shaft & driven shaft) for front axle mounted motors"
                  }
                ]
              },
              {
                "name": "Generator",
                "children": [
                  {
                    "name": "Efficiency",
                    "tooltip": "Efficiency of front generator of electric vehicle (scalar)."
                  },
                  {
                    "name": "Power",
                    "tooltip": "Mechanical power of front generator of electric vehicle (scalar)."
                  },
                  {
                    "name": "Speed",
                    "tooltip": "Maximum rot. speed of front generator of electric vehicle (scalar)."
                  },
                  {
                    "name": "Efficiency2D",
                    "tooltip": "2D table for electric motor efficiency in generator operation mode. Lists efficiency values depending on normalized rot. speed (/_max) and normalized torque (T/T_max)\r\r\n(For front wheel hubs, front driveshaft or front differential)"
                  },
                  {
                    "name": "Torque",
                    "tooltip": "Maximum torque of front generator of electric vehicle (scalar)."
                  },
                  {
                    "name": "Torque1D",
                    "tooltip": "1D table for mapping electric motor torque depending on rotational speed in generator operation mode\r\r\n(For front wheel hubs, front driveshaft or front differential)"
                  },
                  {
                    "name": "MaxTorqueSpeed",
                    "tooltip": "Minimum rotation speed at which the maximum generator torque of the front electric motor is available"
                  }
                ]
              },
              {
                "name": "Motor",
                "children": [
                  {
                    "name": "Efficiency",
                    "tooltip": "Efficiency of front motor of electric vehicle (scalar)."
                  },
                  {
                    "name": "Power",
                    "tooltip": "Mechanical power of front motor of electric vehicle (scalar)."
                  },
                  {
                    "name": "Efficiency2D",
                    "tooltip": "2D table for electric motor efficiency in motor operation mode. Lists efficiency values depending on normalized rot. speed (/_max) and normalized torque (T/T_max)\r\r\n(For front wheel hubs, front driveshaft or front differential)"
                  },
                  {
                    "name": "Speed",
                    "tooltip": "Maximum rot. speed of front motor of electric vehicle (scalar)."
                  },
                  {
                    "name": "Torque",
                    "tooltip": "Maximum torque of front motor of electric vehicle (scalar)."
                  },
                  {
                    "name": "Torque1D",
                    "tooltip": "1D table for mapping electric motor torque depending on rotational speed in motor operation mode\r\r\n(For front wheel hubs, front driveshaft or front differential)"
                  }
                ]
              }
            ]
          },
          {
            "name": "GearReducer",
            "children": [
              {
                "name": "Stiffness",
                "tooltip": "Linear Torsional stiffness of Motor reducer\r\r\n(Amesim paramter name: \"(EV) Motor Reducer Torsional stiffness\")"
              }
            ]
          },
          {
            "name": "Motor",
            "children": [
              {
                "name": "Power",
                "tooltip": "Maximum electric motor power of an EV for the front and rear\r\r\r\n(Amesim parameter name: \"(EV) Max Motor Power\")"
              },
              {
                "name": "Speed",
                "tooltip": "Max Motor RPM of an EV for the front and rear\r\r\r\n(Amesim paramter name: \"(EV) Max Motor RPM\")"
              },
              {
                "name": "Torque",
                "tooltip": "Maximum electric motor torque of an EV for the front and rear\r\r\r\n(Amesim parameter name: \"(EV) Max Motor Torque\")"
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "BuildUpTime",
                "tooltip": "Describes the build up time of motor load. Period of time from pedal displacement until torque generation\r\r\n(For rear wheel hubs, rear driveshaft or rear differential)"
              },
              {
                "name": "FrictionTorqueCoefficient",
                "tooltip": "Gradient between friction torque and rot. speed difference between shafts. Equivalent to friction coefficient\r\r\n(For rear wheel hubs, rear driveshaft or rear differential)"
              },
              {
                "name": "Inertia",
                "tooltip": "Inertia of electric motor\r\r\n(For rear wheel hubs, rear driveshaft or rear differential)"
              },
              {
                "name": "InertiaTensor",
                "tooltip": "Moments of inertia of electric motor\r\r\n(For rear wheel hubs, rear driveshaft or rear differential)"
              },
              {
                "name": "Mass",
                "tooltip": "Mass of electric motor\r\r\n(For rear wheel hubs, rear driveshaft or rear differential)"
              },
              {
                "name": "Position",
                "tooltip": "Position of electric motor in room (T L H)\r\r\n(For rear wheel hubs, rear driveshaft or rear differential)"
              },
              {
                "name": "GearReducer",
                "children": [
                  {
                    "name": "Inertia",
                    "tooltip": "Inertia of motor reducer along reducer axis of an electric vehicle for the rear\r\r\n(Amesim paramter name: \"(EV) Motor Reducer MOI\")"
                  },
                  {
                    "name": "Ratio",
                    "tooltip": "Transmission ratio of reducer gear (ratio electric motor shaft & driven shaft) for rear axle mounted motors"
                  }
                ]
              },
              {
                "name": "Generator",
                "children": [
                  {
                    "name": "Efficiency",
                    "tooltip": "Efficiency of rear generator of electric vehicle (scalar)."
                  },
                  {
                    "name": "Efficiency2D",
                    "tooltip": "2D table for electric motor efficiency in generator operation mode. Lists efficiency values depending on normalized rot. speed (/_max) and normalized torque (T/T_max)\r\r\n(For rear wheel hubs, rear driveshaft or rear differential)"
                  },
                  {
                    "name": "Power",
                    "tooltip": "Mechanical power of rear generator of electric vehicle (scalar)."
                  },
                  {
                    "name": "Speed",
                    "tooltip": "Maximum rot. speed of rear generator of electric vehicle (scalar)."
                  },
                  {
                    "name": "Torque",
                    "tooltip": "Maximum torque of rear generator of electric vehicle (scalar)."
                  },
                  {
                    "name": "MaxTorqueSpeed",
                    "tooltip": "Minimum rotation speed at which the maximum generator torque of the rear electric motor is available"
                  },
                  {
                    "name": "Torque1D",
                    "tooltip": "1D table for mapping electric motor torque depending on rotational speed in generator operation mode\r\r\n(For rear wheel hubs, rear driveshaft or rear differential)"
                  }
                ]
              },
              {
                "name": "Motor",
                "children": [
                  {
                    "name": "Efficiency",
                    "tooltip": "Efficiency of rear motor of electric vehicle (scalar)."
                  },
                  {
                    "name": "Efficiency2D",
                    "tooltip": "2D table for electric motor efficiency in motor operation mode. Lists efficiency values depending on normalized rot. speed (/_max) and normalized torque (T/T_max)\r\r\n(For rear wheel hubs, rear driveshaft or rear differential)"
                  },
                  {
                    "name": "Power",
                    "tooltip": "Mechanical power of rear motor of electric vehicle (scalar)."
                  },
                  {
                    "name": "Speed",
                    "tooltip": "Maximum rot. speed of rear motor of electric vehicle (scalar)."
                  },
                  {
                    "name": "Torque1D",
                    "tooltip": "1D table for mapping electric motor torque depending on rotational speed in motor operation mode\r\r\n(For rear wheel hubs, rear driveshaft or rear differential)"
                  },
                  {
                    "name": "Torque",
                    "tooltip": "Maximum torque of rear motor of electric vehicle (scalar)."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "MCU",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "RotationSpeedControl",
                "children": [
                  {
                    "name": "IntegralValue",
                    "tooltip": "Front Motor MCU PI-Controller for rotational speed. Integral value of the controller"
                  },
                  {
                    "name": "ProportionalValue",
                    "tooltip": "Front Motor MCU PI-Controller for rotational speed. Proportional value of the controller"
                  }
                ]
              },
              {
                "name": "TorqueControl",
                "children": [
                  {
                    "name": "ProportionalValue",
                    "tooltip": "Front Motor MCU PI-Controller for Torque. Proportional value of the controller"
                  },
                  {
                    "name": "IntegralValue",
                    "tooltip": "Front Motor MCU PI-Controller for Torque. Integral value of the controller"
                  }
                ]
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "RotationSpeedControl",
                "children": [
                  {
                    "name": "IntegralValue",
                    "tooltip": "Rear Motor MCU PI-Controller for rotational speed. Integral value of the controller"
                  },
                  {
                    "name": "ProportionalValue",
                    "tooltip": "Rear Motor MCU PI-Controller for rotational speed. Proportional value of the controller"
                  }
                ]
              },
              {
                "name": "TorqueControl",
                "children": [
                  {
                    "name": "IntegralValue",
                    "tooltip": "Rear Motor MCU PI-Controller for Torque. Integral value of the controller"
                  },
                  {
                    "name": "ProportionalValue",
                    "tooltip": "Rear Motor MCU PI-Controller for Torque. Proportional value of the controller"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "Transmission",
        "children": [
          {
            "name": "Clutch",
            "children": [
              {
                "name": "Front",
                "children": [
                  {
                    "name": "FrictionTorque",
                    "tooltip": "Gradient between friction torque and rot. speed difference"
                  },
                  {
                    "name": "MaxTorque",
                    "tooltip": "Maximum torque that can be applied to the clutch"
                  },
                  {
                    "name": "InputShaftInertia",
                    "tooltip": "Inertia of all rotating and spinning clutch input components"
                  },
                  {
                    "name": "OutputShaftInertia",
                    "tooltip": "Inertia of clutch output shaft including all rotating components"
                  },
                  {
                    "name": "SpringConstant",
                    "tooltip": "Torsional spring constant of the clutch"
                  }
                ]
              },
              {
                "name": "Rear",
                "children": [
                  {
                    "name": "FrictionTorque",
                    "tooltip": "Gradient between friction torque and rot. speed difference"
                  },
                  {
                    "name": "InputShaftInertia",
                    "tooltip": "Inertia of all rotating and spinning clutch input components"
                  },
                  {
                    "name": "MaxTorque",
                    "tooltip": "Maximum torque that can be applied to the clutch"
                  },
                  {
                    "name": "OutputShaftInertia",
                    "tooltip": "Inertia of clutch output shaft including all rotating components"
                  },
                  {
                    "name": "SpringConstant",
                    "tooltip": "Torsional spring constant of the clutch"
                  }
                ]
              }
            ]
          },
          {
            "name": "Front",
            "children": [
              {
                "name": "GearRatioReverse",
                "tooltip": "Ratio for the reverse gear. Please upload as a negative value. (E.g.: -3.7)"
              },
              {
                "name": "GearRatio1D",
                "tooltip": "Table including gear number and ratio"
              },
              {
                "name": "GearSpread",
                "tooltip": "The gear spread between the first and the last gear"
              },
              {
                "name": "NumberGears",
                "tooltip": "The total number of gears in the transmission"
              },
              {
                "name": "InertiaTensor",
                "tooltip": "Moment of inertia for the front gearbox. The gearbox body is added to the vehicle bodies and used for the vehicle dynamics calculation."
              },
              {
                "name": "InputShaftInertia",
                "tooltip": "Overall inertia of the gearbox input shaft"
              },
              {
                "name": "Mass",
                "tooltip": "Overall mass of the transmission in use including mountings"
              },
              {
                "name": "OutputShaftInertia",
                "tooltip": "Overall inertia output shaft of the gearbox."
              },
              {
                "name": "Position",
                "tooltip": "Position of transmission unit inside the vehicle"
              },
              {
                "name": "SyncTime",
                "tooltip": "The synchronization time specifies the time to synchronize the rotation speeds (input and output shaft during gear change)."
              },
              {
                "name": "Efficiency1D",
                "tooltip": "Efficieny for all gear numbers. If the number of efficiencies are less than the number of gears, the last entry in the table will be applied to all remaining gears."
              },
              {
                "name": "EfficiencyReverse",
                "tooltip": "Efficiency for reverse gear."
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "GearRatio1D",
                "tooltip": "Table including gear number and ratio"
              },
              {
                "name": "GearRatioReverse",
                "tooltip": "Ratio for the reverse gear. Please upload as a negative value. (E.g.: -3.7)"
              },
              {
                "name": "GearSpread",
                "tooltip": "The gear spread between the first and the last gear"
              },
              {
                "name": "NumberGears",
                "tooltip": "The total number of gears in the transmission"
              },
              {
                "name": "InputShaftInertia",
                "tooltip": "Overall inertia of the gearbox input shaft"
              },
              {
                "name": "InertiaTensor",
                "tooltip": "Moment of inertia for the rear gearbox. The gearbox body is added to the vehicle bodies and used for the vehicle dynamics calculation."
              },
              {
                "name": "Mass",
                "tooltip": "Overall mass of the transmission in use including mountings"
              },
              {
                "name": "OutputShaftInertia",
                "tooltip": "Overall inertia output shaft of the gearbox."
              },
              {
                "name": "Position",
                "tooltip": "Position of transmission unit inside the vehicle"
              },
              {
                "name": "SyncTime",
                "tooltip": "The synchronization time specifies the time to synchronize the rotation speeds (input and output shaft during gear change)."
              },
              {
                "name": "Efficiency1D",
                "tooltip": "Efficieny for all gear numbers. If the number of efficiencies are less than the number of gears, the last entry in the table will be applied to all remaining gears."
              },
              {
                "name": "EfficiencyReverse",
                "tooltip": "Efficiency for reverse gear."
              }
            ]
          },
          {
            "name": "TCU",
            "children": [
              {
                "name": "Front",
                "children": [
                  {
                    "name": "MaxMotorSpeed",
                    "tooltip": "Maximum motor speed while manually shifting gears. If this threshold is reached, the vehicle automatically shifts down"
                  },
                  {
                    "name": "MinMotorSpeed",
                    "tooltip": "Minimum motor speed while manually shifting gears. If this threshold is reached, the vehicle automatically shifts up"
                  },
                  {
                    "name": "ShiftingThrottlePosition2D",
                    "tooltip": "Gear shifting logic with minimal/maximal shifting limits for different throttle positions"
                  },
                  {
                    "name": "ShiftingSpeed2D",
                    "tooltip": "Gear shifting logic with minimal/maximal shifting limits for each gear and motor speed"
                  },
                  {
                    "name": "ShiftTime",
                    "tooltip": "Time intervall between gear changes in a transmission"
                  }
                ]
              },
              {
                "name": "Rear",
                "children": [
                  {
                    "name": "MaxMotorSpeed",
                    "tooltip": "Maximum motor speed while manually shifting gears. If this threshold is reached, the vehicle automatically shifts down"
                  },
                  {
                    "name": "MinMotorSpeed",
                    "tooltip": "Minimum motor speed while manually shifting gears. If this threshold is reached, the vehicle automatically shifts up"
                  },
                  {
                    "name": "ShiftingSpeed2D",
                    "tooltip": "Gear shifting logic with minimal/maximal shifting limits for each gear and motor speed"
                  },
                  {
                    "name": "ShiftingThrottlePosition2D",
                    "tooltip": "Gear shifting logic with minimal/maximal shifting limits for different throttle positions"
                  },
                  {
                    "name": "ShiftTime",
                    "tooltip": "Time intervall between gear changes in a transmission"
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "name": "ENG",
    "children": [
      {
        "name": "DragTorque1D",
        "tooltip": "1D Table which considers engine drag torque against rotational speed"
      },
      {
        "name": "BuildUpTime",
        "tooltip": "Engine build up time"
      },
      {
        "name": "IdleSpeed",
        "tooltip": "This parameter specifies the idle speed of the engine"
      },
      {
        "name": "InertiaProductTensor",
        "tooltip": "Engine products of moments of inertia"
      },
      {
        "name": "IgnitionOffTorque",
        "tooltip": "This torque corresponds to the engine drag torque if the ignition is off"
      },
      {
        "name": "InertiaTensor",
        "tooltip": "Engine moments of inertia"
      },
      {
        "name": "Mass",
        "tooltip": "Total engine mass"
      },
      {
        "name": "MaxPower",
        "tooltip": "Nominal engine power"
      },
      {
        "name": "MaxPowerSpeed",
        "tooltip": "Rotational speed at nominal engine power operation point"
      },
      {
        "name": "MaxTorque",
        "tooltip": "Maximum engine torque"
      },
      {
        "name": "Position",
        "tooltip": "Position of engine in room (Reference: Bell housing center)"
      },
      {
        "name": "MaxTorqueSpeed",
        "tooltip": "Rotational engine speed at maximum torque operation point"
      },
      {
        "name": "StallSpeed",
        "tooltip": "At this rotation speed the engine is turned off"
      },
      {
        "name": "Torque1D",
        "tooltip": "1D Table which considers engine torque against rotational speed"
      },
      {
        "name": "Torque2D",
        "tooltip": "2D Table which includes rotational speed, torque and gas pedal displacement"
      },
      {
        "name": "Alternator",
        "children": [
          {
            "name": "IdleVoltage",
            "tooltip": "Idle Voltage of automotive battery"
          }
        ]
      },
      {
        "name": "Crankshaft",
        "children": [
          {
            "name": "Inertia",
            "tooltip": "Inertia of the engine crankshaft (not the clutch side)\r\r\nFor the clutch side shaft assembly the parameter: 'TRANSMISSION.MANUAL TRANSMISSION.CLUTCH COVER & DISC.INERTIA SHAFT IN' accounts for."
          }
        ]
      },
      {
        "name": "ECU",
        "children": [
          {
            "name": "IdleSpeedControl",
            "children": [
              {
                "name": "IntegralValue",
                "tooltip": "ECU PI-Controller for Idle Speed. Integral value of the controller"
              },
              {
                "name": "PoportionalValue",
                "tooltip": "ECU PI-Controller for Idle Speed. Proportional value of the controller"
              },
              {
                "name": "MaxLoad",
                "tooltip": "ECU PI-Controller for Idle Speed. Defines the maximum load of the controller."
              },
              {
                "name": "TurnoffSpeed",
                "tooltip": "ECU PI-Controller for Idle Speed. Defines the turn off engine speed."
              }
            ]
          },
          {
            "name": "RotationSpeedControl",
            "children": [
              {
                "name": "PoportionalValue",
                "tooltip": "ECU PI-Controller for rotational speed. Proportional value of the controller."
              },
              {
                "name": "IntegralValue",
                "tooltip": "ECU PI-Controller for rotational speed. Integral value of the controller."
              }
            ]
          },
          {
            "name": "TorqueControl",
            "children": [
              {
                "name": "IntegralValue",
                "tooltip": "ECU PI-Controller for Torque. Integral value of the controller"
              },
              {
                "name": "PoportionalValue",
                "tooltip": "ECU PI-Controller for Torque. Proportional value of the controller"
              }
            ]
          },
          {
            "name": "FuelCutOffSpeed",
            "tooltip": "Specifies the engine speed limit above which the fuel is cut-off."
          }
        ]
      },
      {
        "name": "Fuel",
        "children": [
          {
            "name": "Consumption2D",
            "tooltip": "Table which shows fuel consumption at a certain rot. speed and engine torque"
          },
          {
            "name": "Density",
            "tooltip": "Density of fuel"
          },
          {
            "name": "HeatValue",
            "tooltip": "Heat Value of fuel"
          }
        ]
      },
      {
        "name": "InletManifold",
        "children": [
          {
            "name": "OffsetTemperature",
            "tooltip": "Offset temperature in the intake manifold referred to the environment temperature"
          },
          {
            "name": "ReferencePressure",
            "tooltip": "Air pressure when engine map was created"
          },
          {
            "name": "ReferenceTemperature",
            "tooltip": "Temperature when engine map was created"
          },
          {
            "name": "RelativeDensity2D",
            "tooltip": "2D characteristic for intake manifold relative density mapping. Relative air densities are shown for different throttle positions and engine speeds"
          }
        ]
      },
      {
        "name": "Mounting",
        "children": [
          {
            "name": "Number",
            "tooltip": "Number of engine mounts"
          },
          {
            "name": "Center",
            "children": [
              {
                "name": "Damping",
                "tooltip": "Damping of nearest bushing to center along the vehicle longitudinal, lateral and vertical axis in driving direction"
              },
              {
                "name": "LatDamping1D",
                "tooltip": "Damping of in driving direction nearest center bushing along the vehicle lateral axis"
              },
              {
                "name": "LongDamping1D",
                "tooltip": "Damping of in driving direction nearest center bushing along the vehicle longitudinal axis"
              },
              {
                "name": "LatStiffness1D",
                "tooltip": "Stiffness of in driving direction nearest center bushing along the vehicle lateral axis"
              },
              {
                "name": "Position",
                "tooltip": "Position of in driving direction nearest center engine bushing in room (Reference: Bell housing center)"
              },
              {
                "name": "LongStiffness1D",
                "tooltip": "Stiffness of in driving direction nearest center bushing along the vehicle longitudinal axis"
              },
              {
                "name": "Stiffness",
                "tooltip": "Linear stiffness of in driving direction nearest center bushing along the vehicle longitudinal, lateral and vertical axis"
              },
              {
                "name": "VertDamping1D",
                "tooltip": "Damping of in driving direction nearest center bushing along the vehicle vertical axis"
              },
              {
                "name": "VertStiffness1D",
                "tooltip": "Stiffness of in driving direction nearest center bushing along the vehicle vertical axis"
              }
            ]
          },
          {
            "name": "ForceX",
            "children": [
              {
                "name": "Damping1D",
                "tooltip": "Linear Engine Mount Parameter"
              },
              {
                "name": "Stiffness1D",
                "tooltip": "Linear Engine Mount Parameter"
              }
            ]
          },
          {
            "name": "ForceY",
            "children": [
              {
                "name": "Damping1D",
                "tooltip": "Linear Engine Mount Parameter"
              },
              {
                "name": "Stiffness1D",
                "tooltip": "Linear Engine Mount Parameter"
              }
            ]
          },
          {
            "name": "ForceZ",
            "children": [
              {
                "name": "Damping1D",
                "tooltip": "Linear Engine Mount Parameter"
              },
              {
                "name": "Stiffness1D",
                "tooltip": "Linear Engine Mount Parameter"
              }
            ]
          },
          {
            "name": "Left",
            "children": [
              {
                "name": "Damping",
                "tooltip": "Damping of in driving direction most right bushing along the vehicle longitudinal, lateral and vertical axis"
              },
              {
                "name": "LatStiffness1D",
                "tooltip": "Stiffness of in driving direction most left bushing along the vehicle lateral axis"
              },
              {
                "name": "LatDamping1D",
                "tooltip": "Damping of in driving direction most left bushing along the vehicle lateral axis"
              },
              {
                "name": "LongDamping1D",
                "tooltip": "Damping of in driving direction most left bushing along the vehicle longitudinal axis"
              },
              {
                "name": "LongStiffness1D",
                "tooltip": "Stiffness of in driving direction most left bushing along the vehicle longitudinal axis"
              },
              {
                "name": "Position",
                "tooltip": "Position of most left engine bushing in room in driving direction(Reference: Bell housing center)"
              },
              {
                "name": "Stiffness",
                "tooltip": "Linear stiffness of most left bushing along the vehicle logitudinal, lateral and vertical axis in driving direction"
              },
              {
                "name": "VertStiffness1D",
                "tooltip": "Stiffness of in driving direction most left bushing along the vehicle vertical axis"
              },
              {
                "name": "VertDamping1D",
                "tooltip": "Damping of in driving direction most left bushing along the vehicle vertical axis"
              }
            ]
          },
          {
            "name": "Right",
            "children": [
              {
                "name": "Damping",
                "tooltip": "Damping of most right bushing along the vehicle longitudinal, lateral and vertical axis in driving direction"
              },
              {
                "name": "LatDamping1D",
                "tooltip": "Damping of in driving direction most right bushing along the vehicle lateral axis"
              },
              {
                "name": "LatStiffness1D",
                "tooltip": "Stiffness of in driving direction most right bushing along the vehicle lateral axis"
              },
              {
                "name": "LongDamping1D",
                "tooltip": "Damping of in driving direction most right bushing along the vehicle longitudinal axis"
              },
              {
                "name": "Position",
                "tooltip": "Position of most right engine bushing in room in driving direction (Reference: Bell housing center)"
              },
              {
                "name": "LongStiffness1D",
                "tooltip": "Stiffness of in driving direction most right bushing along the vehicle longitudinal axis"
              },
              {
                "name": "Stiffness",
                "tooltip": "Linear stiffness of most right bushing along the vehicle longitudinal , lateral and vertical axis"
              },
              {
                "name": "VertDamping1D",
                "tooltip": "Damping of in driving direction most right bushing along the vehicle vertical axis"
              },
              {
                "name": "VertStiffness1D",
                "tooltip": "Stiffness of in driving direction most right bushing along the vehicle vertical axis"
              }
            ]
          },
          {
            "name": "RollRod",
            "children": [
              {
                "name": "Damping",
                "tooltip": "Damping of roll rod bushing along the vehicle longitudinal, lateral and vertical axis in driving direction"
              },
              {
                "name": "LatDamping1D",
                "tooltip": "Damping of in driving direction roll rod bushing along the vehicle lateral axis"
              },
              {
                "name": "LatStiffness1D",
                "tooltip": "Stiffness of in driving direction roll rod bushing along the vehicle lateral axis"
              },
              {
                "name": "LongDamping1D",
                "tooltip": "Damping of in driving direction roll rod bushing along the vehicle longitudinal axis"
              },
              {
                "name": "LongStiffness1D",
                "tooltip": "Stiffness of in driving direction roll rod bushing along the vehicle longitudinal axis"
              },
              {
                "name": "Position",
                "tooltip": "Position of roll rod engine bushing in room in driving direction (Reference: Bell housing center)"
              },
              {
                "name": "Stiffness",
                "tooltip": "Linear stiffness of roll rod bushing along the vehicle longitudinal, lateral and vertical axis in driving direction"
              },
              {
                "name": "VertDamping1D",
                "tooltip": "Damping of in driving direction roll rod bushing along the vehicle vertical axis"
              },
              {
                "name": "VertStiffness1D",
                "tooltip": "Stiffness of in driving direction roll rod bushing along the vehicle vertical axis"
              }
            ]
          },
          {
            "name": "TorqueX",
            "children": [
              {
                "name": "Damping1D",
                "tooltip": "Linear Engine Mount Parameter"
              },
              {
                "name": "Stiffness1D",
                "tooltip": "Linear Engine Mount Parameter"
              }
            ]
          },
          {
            "name": "TorqueY",
            "children": [
              {
                "name": "Damping1D",
                "tooltip": "Linear Engine Mount Parameter"
              },
              {
                "name": "Stiffness1D",
                "tooltip": "Linear Engine Mount Parameter"
              }
            ]
          }
        ]
      },
      {
        "name": "Starter",
        "children": [
          {
            "name": "BuildUpTime",
            "tooltip": "Specifies the build-up time of the load signal. The delayed build-up is modeled as a PT1 filter."
          },
          {
            "name": "DragCoefficient",
            "tooltip": "Defines the internal motor friction torque that acts as a drag torque if the motor load is zero."
          },
          {
            "name": "Inertia",
            "tooltip": "The starter motor inertia sums up all rotating and spinning components of the motor. For\r\r\nInertia about the vehicle's longitudinal axis it is assumed that the longitudinal axis is along the transmission components."
          },
          {
            "name": "OuputShaftRatio",
            "tooltip": "This parameter describes a constant transmission ratio between the starter motor output shaft and the powertrain shaft that it is connected to (usually engine output shaft)"
          },
          {
            "name": "Generator",
            "children": [
              {
                "name": "Efficiency2D",
                "tooltip": "generator efficiency is described by its values for normalized rotation speeds and normalized torques"
              },
              {
                "name": "Torque1D",
                "tooltip": "maximum generator torque is described by its values for different rotation speeds"
              }
            ]
          },
          {
            "name": "Motor",
            "children": [
              {
                "name": "Efficiency2D",
                "tooltip": "motor efficiency is described by its values for normalized rotation speeds and normalized torques"
              },
              {
                "name": "Torque1D",
                "tooltip": "maximum motor torque is described by its values for different rotation speeds"
              }
            ]
          }
        ]
      },
      {
        "name": "Turbo",
        "children": [
          {
            "name": "CurvatureGradient1D",
            "tooltip": "The torque is built-up with a quadratic gradient. This maps the quadratic increase (the curvature) of torque against time in the quadratic region of the turbo torque build up."
          },
          {
            "name": "HighPressureBuildUpPeriod1D",
            "tooltip": "This maps the high pressure torque region against engine rotational velocity."
          },
          {
            "name": "HighPressureGradient1D",
            "tooltip": "This is the high pressure torqure gradient. Here in simulation the engine torque with help of the turbocharger equals the static engine torque."
          },
          {
            "name": "LinearTorqueGradient1D",
            "tooltip": "The torque is built-up with a linear gradient. This parameter defines the linear region of the turbo torque characteristic."
          },
          {
            "name": "QuadraticTorqueGradient1D",
            "tooltip": "The torque is built-up with a quadratic gradient. This maps the linear increase of torque against time in the quadratic region of the turbo torque build up."
          },
          {
            "name": "CMTurboModel",
            "children": [
              {
                "name": "DeadTime1D",
                "tooltip": "Time it takes from tip-in of driver until additional torque is provided by the turbocharger. In this table the delay between load signal and dynamic engine torque reaction in the first\r\r\nphase of turbocharger intervention for different engine rotation speeds"
              },
              {
                "name": "Curvature1D",
                "tooltip": "This maps the quadratic increase of torque against time in the turbocharger's quadratic region against different engine rotational speeds."
              },
              {
                "name": "LinearGradient1D",
                "tooltip": "This maps the linear torque gradient against different engine rotational speeds."
              },
              {
                "name": "DelayTime1D",
                "tooltip": "The delay time defines the duration of the second phase of turbocharger intervention for\r\r\ndifferent engine rotation speeds."
              },
              {
                "name": "QuadraticGradient1D",
                "tooltip": "This maps the linear increase of torque against time in the turbocharger's quadratic region against different engine rotational speeds."
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "name": "STR",
    "children": [
      {
        "name": "TurningCircle",
        "tooltip": "Turning circle diameter of the vehicle (curb to curb measurement)."
      },
      {
        "name": "Column",
        "children": [
          {
            "name": "AssistForce1D",
            "tooltip": "1D look-Up table for power steering. Assisting force to column torsion angle"
          },
          {
            "name": "BoostMap2D",
            "tooltip": "Specifies the electrical boost characteristic acting on the steering column. Possible values are: Curve (2D non-linear curve depending on torsion bar torque) and Map (3D non-linear map depending on torsion bar torque and vehicle velocity)"
          },
          {
            "name": "LowerInertia",
            "tooltip": "Specifies the total inertia of the lower column parts. This includes the inertia of the hardy disk and intermediate shaft. (Excluding the torsion bar inertia in case of the corresponding EPS configuration)"
          },
          {
            "name": "CardanDisplacement1D",
            "tooltip": "Steering column Cardan displacement lookup table"
          },
          {
            "name": "MotorConstant",
            "tooltip": "Specifies the motor torque constant for column EPS (power unit mounted on steering column)"
          },
          {
            "name": "MotorTieRodRatio",
            "tooltip": "Specifies transmission ratio from electric motor to tie rod for column EPS (power unit mounted on steering column)"
          },
          {
            "name": "Stiffness",
            "tooltip": "Specifies the stiffness of the steering column."
          },
          {
            "name": "ColumnCenter",
            "children": [
              {
                "name": "Position",
                "tooltip": "Position of column point at column center for double cardan joint Pfeffer parametrization. Located at upper end of upper column"
              }
            ]
          },
          {
            "name": "PfefferModel",
            "children": [
              {
                "name": "MaxDampingTorque",
                "tooltip": "Specifies the upper and lower limit of column damping torque"
              },
              {
                "name": "Damping",
                "tooltip": "Specifies the column damping coefficient"
              },
              {
                "name": "MaxFrictionTorque",
                "tooltip": "Specifies the upper limit of the column exponential spring friction torque"
              },
              {
                "name": "MinFrictionTorque",
                "tooltip": "Specifies the lower limit of the column exponential spring friction torque"
              },
              {
                "name": "PhaseAngle",
                "tooltip": "Specifies the difference angle between the two fork planes in the intermediate axle"
              },
              {
                "name": "TorqueGradient",
                "tooltip": "Specifies the stiffness of the column exponential spring friction model"
              }
            ]
          },
          {
            "name": "UJoint1",
            "children": [
              {
                "name": "CardanError",
                "tooltip": "Offset angle for upper column fork"
              },
              {
                "name": "Position",
                "tooltip": "Position of column point at first U-joint for double cardan joint Pfeffer parametrization. Located at upper end of intermediate shaft"
              }
            ]
          },
          {
            "name": "PinionCenter",
            "children": [
              {
                "name": "Position",
                "tooltip": "Position of column point at pinion center for double cardan joint Pfeffer parametrization. Located at lower end of lower column"
              }
            ]
          },
          {
            "name": "UJoint2",
            "children": [
              {
                "name": "Position",
                "tooltip": "Position of of column point at second U-joint for double cardan joint Pfeffer parametrization. Located at lower end of intermediate shaft"
              }
            ]
          }
        ]
      },
      {
        "name": "HardyDisk",
        "children": [
          {
            "name": "PfefferModel",
            "children": [
              {
                "name": "Stiffness",
                "tooltip": "Specifies the stiffness of the hardy disk"
              }
            ]
          }
        ]
      },
      {
        "name": "Pinion",
        "children": [
          {
            "name": "AssistForce1D",
            "tooltip": "1D look-Up table for power steering. Assisting force to pinion angle"
          },
          {
            "name": "BoostMap2D",
            "tooltip": "Specifies the electrical boost characteristic acting on the steering pinion. Possible values are: Curve (2D non-linear curve depending on torsion bar torque) and Map (3D non-linear map depending on torsion bar torque and vehicle velocity)"
          }
        ]
      },
      {
        "name": "Rack",
        "children": [
          {
            "name": "AssistForce1D",
            "tooltip": "1D look-up table for power steering. Assisting force to rack motion"
          },
          {
            "name": "BoostMap2D",
            "tooltip": "Specifies the electrical boost characteristic acting on the steering rack. Possible values are: Curve (2D non-linear curve depending on torsion bar torque) and Map (3D non-linear map depending on torsion bar torque and vehicle velocity)"
          },
          {
            "name": "Damping",
            "tooltip": "The overall damping characteristic of the steering rack"
          },
          {
            "name": "MotorConstant",
            "tooltip": "Specifies the motor torque constant for column EPS (power unit mounted on upper column)"
          },
          {
            "name": "MotorTieRodRatio",
            "tooltip": "Specifies transmission ratio from electric motor to tie rod for column EPS (power unit mounted on upper column)"
          },
          {
            "name": "PinionRatio1D",
            "tooltip": "Kinematic and compliant proportioning of steering wheel angle and rack position required to rotate pinion per unit"
          },
          {
            "name": "RackTravel1D",
            "tooltip": "Ratio between steering rack travel and pinion angle in a 1D table"
          },
          {
            "name": "Ratio",
            "tooltip": "Ratio between steering rack travel and pinion angle"
          },
          {
            "name": "RCBNRatio",
            "tooltip": "Specifies the transmission ratio of recirculating ball nut system: ball screw translation / ball nut rotation"
          },
          {
            "name": "Travel",
            "tooltip": "Specifies the motion range (minimum to maximum translational travel)"
          },
          {
            "name": "PfefferModel",
            "children": [
              {
                "name": "Damping",
                "tooltip": "Specifies the rack damping coefficient"
              },
              {
                "name": "ForceGradient",
                "tooltip": "Specifies the stiffness of the rack exponential spring friction model"
              },
              {
                "name": "DampingForce",
                "tooltip": "Specifies the upper and lower limit of the rack damping force"
              },
              {
                "name": "GearMeshStiffness",
                "tooltip": "Specifies the stiffness of the steering gear mesh"
              },
              {
                "name": "FrictionGradient",
                "tooltip": "Specifies the friction force increase due to pressure. Used only with HPS."
              },
              {
                "name": "Mass",
                "tooltip": "Mass of entire steering rack including tie rods for CarMaker Pfeffer parameterization"
              },
              {
                "name": "MaxFrictionForce",
                "tooltip": "Specifies the upper limit of the rack exponential spring friction force"
              },
              {
                "name": "MinFrictionForce",
                "tooltip": "Specifies the lower limit of the rack exponential spring friction force"
              }
            ]
          }
        ]
      },
      {
        "name": "System",
        "children": [
          {
            "name": "Damping",
            "tooltip": "Overall damping of all rotating parts such as wheel, column etc."
          },
          {
            "name": "Stiffness",
            "tooltip": "Overall stiffness of all rotating parts such as wheel, column etc."
          },
          {
            "name": "Inertia",
            "tooltip": "Overall inertia of all rotating parts such as the steering wheel, torsion bar, upper column, intermediate shaft and lower column"
          }
        ]
      },
      {
        "name": "TorsionBar",
        "children": [
          {
            "name": "Damping",
            "tooltip": "Specifies the damping of the torsion bar. Only change this parameter if it was obtained through ADAMS!"
          },
          {
            "name": "Inertia",
            "tooltip": "This is the inertia of the torsion bar only"
          },
          {
            "name": "MinFrictionTorque",
            "tooltip": "Specifies the lower limit of the torsion bar exponential spring friction torque. Only change this parameter if it was obtained through ADAMS!"
          },
          {
            "name": "MaxFrictionTorque",
            "tooltip": "Specifies the upper limit of the torsion bar exponential spring friction torque. Only change this parameter if it was obtained through ADAMS!"
          },
          {
            "name": "Stiffness2D",
            "tooltip": "Specifies the torsion bar torque map. First column is the torsion bar twist angle; second column is the torsion bar twist torque and the third column is the vehicle velocity. Using this map the torsion bar stiffness is determined"
          },
          {
            "name": "Stiffness",
            "tooltip": "Specifies the stiffness of the torsion bar as a constant"
          },
          {
            "name": "TorqueGradient",
            "tooltip": "Specifies the stiffness of the torsion bar exponential spring friction model. Only change this parameter if it was obtained through ADAMS!"
          },
          {
            "name": "PfefferModel",
            "children": [
              {
                "name": "MaxStiffness",
                "tooltip": "Specifies the stiffness of the torsion bar outside of the upper and lower twist angle"
              },
              {
                "name": "MaxTwistAngle",
                "tooltip": "Specifies the upper and lower limit of the torsion bar twist angle"
              }
            ]
          }
        ]
      },
      {
        "name": "Wheel",
        "children": [
          {
            "name": "MaxAngle",
            "tooltip": "Absolut rotation of steering wheel from mid position to maximum"
          }
        ]
      },
      {
        "name": "WheelColumn",
        "children": [
          {
            "name": "Inertia",
            "tooltip": "Specifies the total inertia of the upper column and the steering wheel. (Excluding the torsion bar inertia in case of the corresponding EPS configuration)"
          }
        ]
      }
    ]
  },
  {
    "name": "SUS",
    "children": [
      {
        "name": "AssistArm",
        "children": [
          {
            "name": "Rear",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the mass of the rear assist arm"
              }
            ]
          }
        ]
      },
      {
        "name": "Axle",
        "children": [
          {
            "name": "WheelBase",
            "tooltip": "This is the vehicle wheelbase measured tire contact patch to tire contact patch"
          },
          {
            "name": "Front",
            "children": [
              {
                "name": "Load",
                "tooltip": "Preload of Front Suspension with gravity\r\r\nAmesim Parameter: \"Front SUSP Axle load\""
              },
              {
                "name": "TrackWidth",
                "tooltip": "Vehicle front track width measured at the tire contact patch"
              },
              {
                "name": "RideFrequency",
                "tooltip": "Front ride frequency approximation as in Suspension Test Rig Results"
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "Load",
                "tooltip": "Preload of Rear Suspension with gravity\r\r\nAmesim Parameter: \"Rear SUSP Axle load\""
              },
              {
                "name": "RideFrequency",
                "tooltip": "Rear ride frequency approximation as in Suspension Test Rig Results"
              },
              {
                "name": "TrackWidth",
                "tooltip": "Vehicle rear track width measured at the tire contact patch"
              }
            ]
          }
        ]
      },
      {
        "name": "BumpStop",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "PullStiffness",
                "tooltip": "The pull stiffness of the front buffer as a scalar"
              },
              {
                "name": "PullUnstressedLength",
                "tooltip": "Free front wheel compression (wheel travel) before the stopper bumper (buffer) is touched"
              },
              {
                "name": "PullStiffness1D",
                "tooltip": "The stiffness of the front suspension lower buffer in a 1D table (rebound direction)."
              },
              {
                "name": "PushStiffness",
                "tooltip": "The push stiffness of the front buffer as a scalar"
              },
              {
                "name": "PushStiffness1D",
                "tooltip": "The stiffness of the front suspension upper buffer in a 1D table (compression when driving over a bump in the road)."
              },
              {
                "name": "PushUnstressedLength",
                "tooltip": "Free front wheel de-compression (wheel travel) before the stopper bumper (buffer) is touched"
              },
              {
                "name": "KnC",
                "children": [
                  {
                    "name": "MotionRatio",
                    "children": [
                      {
                        "name": "BumpEffect",
                        "tooltip": "Motion ratio of buffers (front suspension)"
                      },
                      {
                        "name": "OppositeEffect",
                        "tooltip": "Motion ratio of buffers (front suspension) as a result of antiparallel (roll) compression where the opposite suspension side is fixed"
                      },
                      {
                        "name": "SteerEffect",
                        "tooltip": "Motion ratio of buffers (front suspension) as a result of steering rack movement"
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "PullStiffness",
                "tooltip": "The pull stiffness of the rear buffer as a scalar"
              },
              {
                "name": "PullStiffness1D",
                "tooltip": "The stiffness of the rear suspension lower buffer in a 1D table (rebound direction)."
              },
              {
                "name": "PullUnstressedLength",
                "tooltip": "Free rear wheel compression (wheel travel) before the stopper bumper (buffer) is touched"
              },
              {
                "name": "PushStiffness",
                "tooltip": "The push stiffness of the rear buffer as a scalar"
              },
              {
                "name": "PushStiffness1D",
                "tooltip": "The stiffness of the rear suspension upper buffer in a 1D table (compression when driving over a bump in the road)."
              },
              {
                "name": "PushUnstressedLength",
                "tooltip": "Free rear wheel de-compression (wheel travel) before the stopper bumper (buffer) is touched"
              },
              {
                "name": "KnC",
                "children": [
                  {
                    "name": "MotionRatio",
                    "children": [
                      {
                        "name": "BumpEffect",
                        "tooltip": "Motion ratio of buffers (rear suspension)"
                      },
                      {
                        "name": "OppositeEffect",
                        "tooltip": "Motion ratio of buffers (rear suspension) as a result of antiparallel (roll) compression where the opposite suspension side is fixed"
                      },
                      {
                        "name": "SteerEffect",
                        "tooltip": "Motion ratio of buffers (rear suspension) as a result of steering rack movement"
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "Carrier",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Left",
                "children": [
                  {
                    "name": "InertiaProductTensor",
                    "tooltip": "Wheel carrier products of moments of inertia front left"
                  },
                  {
                    "name": "InertiaTensor",
                    "tooltip": "Wheel carrier moments of inertia front left"
                  },
                  {
                    "name": "Mass",
                    "tooltip": "Mass of front left wheel carrier (As of CarMaker parametrization. Please note, the carrier also accounts for other surrounding components that are classified as unsprung mass such as the brake disk, brake caliper, X% of spring and the damper, driveshaft etc.)"
                  },
                  {
                    "name": "Position",
                    "tooltip": "Wheel carrier center point front left"
                  }
                ]
              },
              {
                "name": "Right",
                "children": [
                  {
                    "name": "InertiaProductTensor",
                    "tooltip": "Wheel carrier products of moments of inertia Front"
                  },
                  {
                    "name": "Mass",
                    "tooltip": "Mass of front rear wheel carrier (As of CarMaker parametrization. Please note, the carrier also accounts for other surrounding components that are classified as unsprung mass such as the brake disk, brake caliper, X% of spring and the damper, driveshaft etc.)"
                  },
                  {
                    "name": "InertiaTensor",
                    "tooltip": "Wheel carrier moments of inertia front right"
                  },
                  {
                    "name": "Position",
                    "tooltip": "Wheel carrier center point front right"
                  }
                ]
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "Left",
                "children": [
                  {
                    "name": "InertiaProductTensor",
                    "tooltip": "Wheel carrier products of moments of inertia rear left"
                  },
                  {
                    "name": "InertiaTensor",
                    "tooltip": "Wheel carrier moments of inertia rear left"
                  },
                  {
                    "name": "Mass",
                    "tooltip": "Mass of rear left wheel carrier (As of CarMaker parametrization. Please note, the carrier also accounts for other surrounding components that are classified as unsprung mass such as the brake disk, brake caliper, X% of spring and the damper, driveshaft etc.)"
                  },
                  {
                    "name": "Position",
                    "tooltip": "Wheel carrier center point rear left"
                  }
                ]
              },
              {
                "name": "Right",
                "children": [
                  {
                    "name": "InertiaProductTensor",
                    "tooltip": "Wheel carrier products of moments of inertia rear right"
                  },
                  {
                    "name": "Mass",
                    "tooltip": "Mass of rear right wheel carrier (As of CarMaker parametrization. Please note, the carrier also accounts for other surrounding components that are classified as unsprung mass such as the brake disk, brake caliper, X% of spring and the damper, driveshaft etc.)"
                  },
                  {
                    "name": "InertiaTensor",
                    "tooltip": "Wheel carrier moments of inertia rear right"
                  },
                  {
                    "name": "Position",
                    "tooltip": "Wheel carrier center point rear right"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "CenterArm",
        "children": [
          {
            "name": "Rear",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the rear mass of the center arm"
              }
            ]
          }
        ]
      },
      {
        "name": "Crossmember",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the front mass of the cross member"
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the rear mass of the cross member"
              }
            ]
          }
        ]
      },
      {
        "name": "Damper",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Damping1D",
                "tooltip": "Shock absorber damping force characteristic in a 1D table - front suspension"
              },
              {
                "name": "Mass",
                "tooltip": "This is the front mass of the shock absorber"
              },
              {
                "name": "KnC",
                "children": [
                  {
                    "name": "MotionRatio",
                    "children": [
                      {
                        "name": "BumpEffect",
                        "tooltip": "Motion ratio of dampers (front suspension)"
                      },
                      {
                        "name": "SteerEffect",
                        "tooltip": "Motion ratio of dampers (front suspension) as a result of steering rack movement"
                      },
                      {
                        "name": "OppositeEffect",
                        "tooltip": "Motion ratio of dampers (front suspension) as a result of antiparallel (roll) compression where the opposite suspension side is fixed"
                      }
                    ]
                  }
                ]
              },
              {
                "name": "DampingPull",
                "tooltip": "Scalar Damper Parameter"
              },
              {
                "name": "DampingPush",
                "tooltip": "Scalar Damper Parameter"
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the rear mass of the shock absorber"
              },
              {
                "name": "Damping1D",
                "tooltip": "Shock absorber damping characteristic in a 1D table - rear suspension"
              },
              {
                "name": "KnC",
                "children": [
                  {
                    "name": "MotionRatio",
                    "children": [
                      {
                        "name": "BumpEffect",
                        "tooltip": "Motion ratio of dampers (rear suspension)"
                      },
                      {
                        "name": "OppositeEffect",
                        "tooltip": "Motion ratio of dampers (rear suspension) as a result of antiparallel (roll) compression where the opposite suspension side is fixed"
                      },
                      {
                        "name": "SteerEffect",
                        "tooltip": "Motion ratio of dampers (rear suspension) as a result of steering rack movement"
                      }
                    ]
                  }
                ]
              },
              {
                "name": "DampingPull",
                "tooltip": "Scalar Damper Parameter"
              },
              {
                "name": "DampingPush",
                "tooltip": "Scalar Damper Parameter"
              }
            ]
          }
        ]
      },
      {
        "name": "Front",
        "children": [
          {
            "name": "LongDamping",
            "tooltip": "Amesim Parameter: \"Front SUSP Longi damping\""
          },
          {
            "name": "UnsprungMass",
            "tooltip": "Front Suspension Weigth (Unsprung mass)\r\r\nAmesim Parameter: \"Front SUSP WT\""
          },
          {
            "name": "LongStiffness",
            "tooltip": "Amesim Parameter: \"Front SUSP Longi stiffness\""
          },
          {
            "name": "VertDamping",
            "tooltip": "Amesim Parameter: \"Front SUSP Vertical damping\""
          },
          {
            "name": "VertStiffness",
            "tooltip": "Amesim Parameter: \"Front SUSP Vertical stiffness\""
          }
        ]
      },
      {
        "name": "Kinematics",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Left",
                "children": [
                  {
                    "name": "Buffer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "BufferCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "BufferOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "BufferSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "Camber",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "CamberCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "CamberOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "CamberSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "DamperCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "Damper",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "DamperOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "DamperSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "DeflectionStabilizer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "DeflectionStabilizerCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "DeflectionStabilizerOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "Spin",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "DeflectionStabilizerSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "SpinCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "SpinOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "SpinSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "Spring",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "SpringOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "SpringCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "SpringSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "Toe",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "ToeCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "ToeOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "ToeSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "Track",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "TrackOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "TrackCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "TrackSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelCenter",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelCenterOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelCenterCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelCenterSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelTravel",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelTravelCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelTravelOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelTravelSteer",
                    "tooltip": "Parameter For Linear KNC"
                  }
                ]
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "Left",
                "children": [
                  {
                    "name": "Buffer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "BufferCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "BufferOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "BufferSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "CamberCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "Camber",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "CamberOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "Damper",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "CamberSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "DamperCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "DamperSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "DamperOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "DeflectionStabilizer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "DeflectionStabilizerOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "DeflectionStabilizerCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "DeflectionStabilizerSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "Spin",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "SpinCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "SpinOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "SpinSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "Spring",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "SpringCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "SpringOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "SpringSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "Toe",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "ToeCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "ToeSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "ToeOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "TrackCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "Track",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "TrackOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelCenter",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelCenterCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "TrackSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelCenterSteer",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelCenterOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelTravel",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelTravelOpposite",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelTravelCompression",
                    "tooltip": "Parameter For Linear KNC"
                  },
                  {
                    "name": "WheelTravelSteer",
                    "tooltip": "Parameter For Linear KNC"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "KNC",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Left",
                "children": [
                  {
                    "name": "Camber",
                    "tooltip": "Static camber angle of the front left wheel around the vehicle's longitudinal axis. The value should relate to the equilibrium position of the test bench. A positive camber angle at the right wheel carrier equals a positive rotation around the vehicle's longitudinal axis (longitudinal axis pointing positive in driving direction). A negative camber angle at the right wheel carrier equals a negative rotation around the vehicle's longitudinal axis (longitudinal axis pointing positive in driving direction). Attention, this convention applies for MTS test benches only. For ABD test benches please set your chosen convention in the K&C converter's configuration file."
                  },
                  {
                    "name": "Spin",
                    "tooltip": "Static spin (rotation) angle of the front left wheel around the vehicle's lateral axis. The value should relate to the equilibrium position of the test bench. A positive spin angle at the wheel carrier equals a positive rotation around the vehicle's lateral axis (axis pointing positive leftward in driving direction). A negative spin angle at the wheel carrier equals a negative rotation around the vehicle's lateral axis (axis pointing positive leftward in driving direction). Attention, the spin angle is not to confuse with the Caster angle."
                  },
                  {
                    "name": "Toe",
                    "tooltip": "Static toe angle of the front left wheel around the vehicle's vertical axis. The value should relate to the equilibrium position of the test bench. A positive toe angle at the right wheel carrier equals a positive rotation around the vehicle's vertical axis (axis pointing positive in upward direction). A negative toe angle at the right wheel carrier equals a negative rotation around the vehicle's vertical axis (axis pointing positive in upward direction)."
                  }
                ]
              },
              {
                "name": "Right",
                "children": [
                  {
                    "name": "Camber",
                    "tooltip": "Static camber angle of the front right wheel around the vehicle's longitudinal axis. The value should relate to the equilibrium position of the test bench. A positive camber angle at the right wheel carrier equals a positive rotation around the vehicle's longitudinal axis (longitudinal axis pointing positive in driving direction). A negative camber angle at the right wheel carrier equals a negative rotation around the vehicle's longitudinal axis (longitudinal axis pointing positive in driving direction). Attention, this convention applies for MTS test benches only. For ABD test benches please set your chosen convention in the K&C converter's configuration file."
                  },
                  {
                    "name": "Spin",
                    "tooltip": "Static spin (rotation) angle of the front right wheel around the vehicle's lateral axis. The value should relate to the equilibrium position of the test bench. A positive spin angle at the wheel carrier equals a positive rotation around the vehicle's lateral axis (axis pointing positive leftward in driving direction). A negative spin angle at the wheel carrier equals a negative rotation around the vehicle's lateral axis (axis pointing positive leftward in driving direction). Attention, the spin angle is not to confuse with the Caster angle."
                  },
                  {
                    "name": "Toe",
                    "tooltip": "Static toe angle of the front right wheel around the vehicle's vertical axis. The value should relate to the equilibrium position of the test bench. A positive toe angle at the right wheel carrier equals a positive rotation around the vehicle's vertical axis (axis pointing positive in upward direction). A negative toe angle at the right wheel carrier equals a negative rotation around the vehicle's vertical axis (axis pointing positive in upward direction)."
                  }
                ]
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "Left",
                "children": [
                  {
                    "name": "Camber",
                    "tooltip": "Static camber angle of the rear left wheel around the vehicle's longitudinal axis. The value should relate to the equilibrium position of the test bench. A positive camber angle at the right wheel carrier equals a positive rotation around the vehicle's longitudinal axis (longitudinal axis pointing positive in driving direction). A negative camber angle at the right wheel carrier equals a negative rotation around the vehicle's longitudinal axis (longitudinal axis pointing positive in driving direction). Attention, this convention applies for MTS test benches only. For ABD test benches please set your chosen convention in the K&C converter's configuration file."
                  },
                  {
                    "name": "Spin",
                    "tooltip": "Static spin (rotation) angle of the rear left wheel around the vehicle's lateral axis. The value should relate to the equilibrium position of the test bench. A positive spin angle at the wheel carrier equals a positive rotation around the vehicle's lateral axis (axis pointing positive leftward in driving direction). A negative spin angle at the wheel carrier equals a negative rotation around the vehicle's lateral axis (axis pointing positive leftward in driving direction). Attention, the spin angle is not to confuse with the Caster angle."
                  },
                  {
                    "name": "Toe",
                    "tooltip": "Static toe angle of the rear left wheel around the vehicle's vertical axis. The value should relate to the equilibrium position of the test bench. A positive toe angle at the right wheel carrier equals a positive rotation around the vehicle's vertical axis (axis pointing positive in upward direction). A negative toe angle at the right wheel carrier equals a negative rotation around the vehicle's vertical axis (axis pointing positive in upward direction)."
                  }
                ]
              },
              {
                "name": "Right",
                "children": [
                  {
                    "name": "Spin",
                    "tooltip": "Static spin (rotation) angle of the rear right wheel around the vehicle's lateral axis. The value should relate to the equilibrium position of the test bench. A positive spin angle at the wheel carrier equals a positive rotation around the vehicle's lateral axis (axis pointing positive leftward in driving direction). A negative spin angle at the wheel carrier equals a negative rotation around the vehicle's lateral axis (axis pointing positive leftward in driving direction). Attention, the spin angle is not to confuse with the Caster angle."
                  },
                  {
                    "name": "Camber",
                    "tooltip": "Static camber angle of the rear right wheel around the vehicle's longitudinal axis. The value should relate to the equilibrium position of the test bench. A positive camber angle at the right wheel carrier equals a positive rotation around the vehicle's longitudinal axis (longitudinal axis pointing positive in driving direction). A negative camber angle at the right wheel carrier equals a negative rotation around the vehicle's longitudinal axis (longitudinal axis pointing positive in driving direction). Attention, this convention applies for MTS test benches only. For ABD test benches please set your chosen convention in the K&C converter's configuration file."
                  },
                  {
                    "name": "Toe",
                    "tooltip": "Static toe angle of the rear right wheel around the vehicle's vertical axis. The value should relate to the equilibrium position of the test bench. A positive toe angle at the right wheel carrier equals a positive rotation around the vehicle's vertical axis (axis pointing positive in upward direction). A negative toe angle at the right wheel carrier equals a negative rotation around the vehicle's vertical axis (axis pointing positive in upward direction)."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "LatRodAssembly",
        "children": [
          {
            "name": "Rear",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the mass of the lateral rod (Panhard Rod)"
              }
            ]
          }
        ]
      },
      {
        "name": "LowerArm",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the mass of the front lower (wishbone) arm"
              }
            ]
          }
        ]
      },
      {
        "name": "Rear",
        "children": [
          {
            "name": "LongDamping",
            "tooltip": "Amesim Parameter: \"Rear SUSP Longi damping\""
          },
          {
            "name": "UnsprungMass",
            "tooltip": "Rear Suspension Weight (Unsprung mass)\r\r\nAmesim Parameter: \"Rear SUSP WT\""
          },
          {
            "name": "LongStiffness",
            "tooltip": "Amesim Parameter: \"Rear SUSP Longi stiffness\""
          },
          {
            "name": "VertDamping",
            "tooltip": "Amesim Parameter: \"Rear SUSP Vertical damping\""
          },
          {
            "name": "VertStiffness",
            "tooltip": "Amesim Parameter: \"Rear SUSP Vertical stiffness\""
          }
        ]
      },
      {
        "name": "SecSpring",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Stiffness",
                "tooltip": "Front wheel rate parasitic stiffness that is not captured by the spring"
              },
              {
                "name": "Stiffness1D",
                "tooltip": "Front wheel rate parasitic stiffness that is not captured by the spring in a 1D table"
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "Stiffness",
                "tooltip": "Rear wheel rate parasitic stiffness that is not captured by the spring"
              },
              {
                "name": "Stiffness1D",
                "tooltip": "Rear wheel rate parasitic stiffness that is not captured by the spring in a 1D table"
              }
            ]
          }
        ]
      },
      {
        "name": "Spring",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the mass of the front spring component"
              },
              {
                "name": "Stiffness1D",
                "tooltip": "Spring stiffness characteristic in a 1D table - front suspension"
              },
              {
                "name": "Stiffness",
                "tooltip": "Stiffness of spring - front suspension"
              },
              {
                "name": "UnstressedLength",
                "tooltip": "Unstressed spring length - front suspension"
              },
              {
                "name": "KnC",
                "children": [
                  {
                    "name": "MotionRatio",
                    "children": [
                      {
                        "name": "BumpEffect",
                        "tooltip": "Motion ratio of springs (front suspension)"
                      },
                      {
                        "name": "OppositeEffect",
                        "tooltip": "Motion ratio of springs (front suspension) as a result of antiparallel (roll) compression where the opposite suspension side is fixed"
                      },
                      {
                        "name": "SteerEffect",
                        "tooltip": "Motion ratio of springs (front suspension) as a result of steering rack movement"
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the mass of the rear spring component"
              },
              {
                "name": "Stiffness",
                "tooltip": "Spring stiffness characteristic - rear suspension"
              },
              {
                "name": "Stiffness1D",
                "tooltip": "Spring stiffness characteristic in a 1D table - rear suspension"
              },
              {
                "name": "KnC",
                "children": [
                  {
                    "name": "MotionRatio",
                    "children": [
                      {
                        "name": "BumpEffect",
                        "tooltip": "Motion ratio of springs (rear suspension)"
                      },
                      {
                        "name": "OppositeEffect",
                        "tooltip": "Motion ratio of springs (rear suspension) as a result of antiparallel (roll) compression where the opposite suspension side is fixed"
                      },
                      {
                        "name": "SteerEffect",
                        "tooltip": "Motion ratio of springs (rear suspension) as a result of steering rack movement"
                      }
                    ]
                  }
                ]
              },
              {
                "name": "UnstressedLength",
                "tooltip": "Unstressed spring length - rear suspension"
              }
            ]
          }
        ]
      },
      {
        "name": "Stab",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the mass of the front stabilizer / anti-roll bar"
              },
              {
                "name": "Stiffness",
                "tooltip": "Stabilizer stiffness characteristic - front suspension (no torsional effects)"
              },
              {
                "name": "Stiffness1D",
                "tooltip": "Stabilizer stiffness characteristic - front suspension (with torsional effects)"
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the mass of the rear stabilizer / anti-roll bar"
              },
              {
                "name": "Stiffness",
                "tooltip": "Stabilizer stiffness characteristic - rear suspension (no torsional effects)"
              },
              {
                "name": "Stiffness1D",
                "tooltip": "Stabilizer stiffness characteristic in a 1D table - rear suspension (with torsional effects)"
              }
            ]
          }
        ]
      },
      {
        "name": "Strut",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Damping",
                "tooltip": "Damping characteristic of top mount - front suspension"
              },
              {
                "name": "Stiffness",
                "tooltip": "Stiffness characteristic of top mount - front suspension"
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "Damping",
                "tooltip": "Damping characteristic of top mount - rear suspension"
              },
              {
                "name": "Stiffness",
                "tooltip": "Stiffness characteristic of top mount - rear suspension"
              }
            ]
          }
        ]
      },
      {
        "name": "TieRod",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the mass of the tie rod"
              }
            ]
          }
        ]
      },
      {
        "name": "StrutBar",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Mass",
                "tooltip": "Strut tower bar mass"
              }
            ]
          }
        ]
      },
      {
        "name": "TrailingArm",
        "children": [
          {
            "name": "Rear",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the mass of the rear trailing arm"
              }
            ]
          }
        ]
      },
      {
        "name": "UpperArm",
        "children": [
          {
            "name": "Rear",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the mass of the rear upper arm"
              }
            ]
          },
          {
            "name": "Front",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the mass of the front upper arm"
              }
            ]
          }
        ]
      },
      {
        "name": "TwistBeam",
        "children": [
          {
            "name": "Rear",
            "children": [
              {
                "name": "Mass",
                "tooltip": "This is the mass of the rear twist beam"
              }
            ]
          }
        ]
      },
      {
        "name": "Wheel",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Left",
                "children": [
                  {
                    "name": "InertiaTensor",
                    "tooltip": "Moments of inertia of Wheel front left"
                  },
                  {
                    "name": "InertiaProductTensor",
                    "tooltip": "Products of moments of inertia of Wheel front left"
                  },
                  {
                    "name": "Mass",
                    "tooltip": "Mass of front left wheel, tire, brake disk and half of drive shaft combined (rotating unsprung mass)"
                  },
                  {
                    "name": "Position",
                    "tooltip": "Wheel & Tire center point front left"
                  }
                ]
              },
              {
                "name": "Right",
                "children": [
                  {
                    "name": "InertiaProductTensor",
                    "tooltip": "Products of moments of inertia of Wheel Front"
                  },
                  {
                    "name": "InertiaTensor",
                    "tooltip": "Moments of inertia of Wheel Front"
                  },
                  {
                    "name": "Mass",
                    "tooltip": "Mass of Front wheel, tire, brake disk and half of drive shaft combined (rotating unsprung mass)"
                  },
                  {
                    "name": "Position",
                    "tooltip": "Wheel & Tire center point Front"
                  }
                ]
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "Left",
                "children": [
                  {
                    "name": "InertiaProductTensor",
                    "tooltip": "Products of moments of inertia of Wheel rear left"
                  },
                  {
                    "name": "InertiaTensor",
                    "tooltip": "Moments of inertia of Wheel rear left"
                  },
                  {
                    "name": "Mass",
                    "tooltip": "Mass of rear left wheel, tire, brake disk and half of drive shaft combined (rotating unsprung mass)"
                  },
                  {
                    "name": "Position",
                    "tooltip": "Wheel & Tire center point rear left"
                  }
                ]
              },
              {
                "name": "Right",
                "children": [
                  {
                    "name": "InertiaTensor",
                    "tooltip": "Moments of inertia of Wheel rear right"
                  },
                  {
                    "name": "InertiaProductTensor",
                    "tooltip": "Products of moments of inertia of Wheel Rear"
                  },
                  {
                    "name": "Mass",
                    "tooltip": "Mass of Rear wheel, tire, brake disk and half of drive shaft combined (rotating unsprung mass)"
                  },
                  {
                    "name": "Position",
                    "tooltip": "Wheel & Tire center point rear right"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "WheelTire",
        "children": [
          {
            "name": "Front",
            "children": [
              {
                "name": "Inertia",
                "tooltip": "Combined moment of inertia of front tire belt and rim\r\r\n(Amesim parameter name: \"WHL & TIRE MOI\")"
              },
              {
                "name": "Mass",
                "tooltip": "Combined mass of tire belt and the rim\r\r\n(Amesim parameter name \"WHL & TIRE mass\"9"
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "Mass",
                "tooltip": "Combined mass of tire belt and the rim\r\r\n(Amesim parameter name \"WHL & TIRE mass\")"
              },
              {
                "name": "Inertia",
                "tooltip": "Combined moment of inertia of rear tire belt and rim\r\r\n(Amesim parameter name: \"WHL & TIRE MOI\")"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "name": "TRM",
    "children": [
      {
        "name": "GearSpread",
        "tooltip": "The gear spread between the first and the last gear"
      },
      {
        "name": "NumberGears",
        "tooltip": "The total number of gears in the transmission"
      },
      {
        "name": "BellHousing",
        "children": [
          {
            "name": "Position",
            "tooltip": "Position of bell housing center inside vehicle transmission (right hand rule in reverse driving direction)"
          }
        ]
      },
      {
        "name": "Clutch",
        "children": [
          {
            "name": "ConnectPosition",
            "tooltip": "This is the position of the clutch when it starts slipping when opening. The scalar value 1 corresponds to a fully pressed clutch and 0 to a closed clutch."
          },
          {
            "name": "DisconnectPosition",
            "tooltip": "This is the position of the clutch when it starts transferring torque when closing. The scalar value 1 corresponds to a fully pressed clutch and 0 to a closed clutch."
          },
          {
            "name": "FrictionTorque",
            "tooltip": "Gradient between friction torque and rot. speed difference between shafts. Equivalent to Friction Coefficient"
          },
          {
            "name": "InputShaftInertia",
            "tooltip": "Overall inertia input shaft coming from engine (crankshaft)"
          },
          {
            "name": "MaxTorque",
            "tooltip": "Maximum torque that can be applied to clutch"
          },
          {
            "name": "OutputShaftInertia",
            "tooltip": "Overall inertia output shaft"
          },
          {
            "name": "TorsionalSpring",
            "tooltip": "Torsional spring constant of the clutch"
          },
          {
            "name": "TorsionalSpring1D",
            "tooltip": "One dimensional characteristic for the clutch spring torque mapping. Describes how much torque is transmitted at certain deflection angle."
          }
        ]
      },
      {
        "name": "Converter",
        "children": [
          {
            "name": "FactorKE1D",
            "tooltip": "The conversion factor k_E . Characteristic for the input torque conversion factor."
          },
          {
            "name": "FrictionCoefficient1D",
            "tooltip": "Torque ratio characteristic."
          },
          {
            "name": "InputShaftInertia",
            "tooltip": "This inertia sums up all rotating and spinning converter clutch input components"
          },
          {
            "name": "OutputShaftInertia",
            "tooltip": "This inertia sums up all rotating and spinning converter clutch output components"
          },
          {
            "name": "Stiffness",
            "tooltip": "Linear stiffness of the converter clutch model"
          },
          {
            "name": "LockUpClutch",
            "children": [
              {
                "name": "Stiffness",
                "tooltip": "This spring constant defines the stiffness of the converters lock-up clutch"
              },
              {
                "name": "DisconnectPosition",
                "tooltip": "At this lockup position/signal from TCU the clutch starts transferring torque when closing"
              }
            ]
          }
        ]
      },
      {
        "name": "DCT",
        "children": [
          {
            "name": "InputShaftLoss",
            "tooltip": "Characteristic value for torque loss inside DCT depending on the shafts rotation speed. The torque loss represents the friction effects on the gearbox shafts. This torque loss only applies to the not synchronized input shaft."
          },
          {
            "name": "InputShaftLoss1D",
            "tooltip": "Characteristic table for torque loss inside DCT depending on the shafts rotation speed. The torque loss represents the friction effects on the gearbox shafts. Applies to both input shafts"
          },
          {
            "name": "Clutch",
            "children": [
              {
                "name": "EvenOutputShaftInertia",
                "tooltip": "Inertia of clutch output shaft including all rotating components such as the even forward drive gears"
              },
              {
                "name": "FrictionTorque",
                "tooltip": "Gradient between friction torque and rot. speed difference between shafts for DCT clutch. Equivalent to Friction Coefficient"
              },
              {
                "name": "MaxTorque",
                "tooltip": "Maximum torque that can be applied to DCT clutches"
              },
              {
                "name": "InputShaftInertia",
                "tooltip": "Inertia of all rotating and spinning clutch input components, from the flywheel up to the first clutch plate. Same inertia used for both DCT clutches."
              },
              {
                "name": "OddOutputShaftInertia",
                "tooltip": "Inertia of clutch output shaft including all rotating components such as the odd (uneven) gears and the backwards gear"
              },
              {
                "name": "TorsionalSpring",
                "tooltip": "Torsional spring constant of the DCT clutches"
              }
            ]
          },
          {
            "name": "EvenInputShaftInertia",
            "tooltip": "Inertia DCT input shaft (even gears)"
          },
          {
            "name": "OddInputShaftInertia",
            "tooltip": "Inertia DCT input shaft (odd gears)"
          }
        ]
      },
      {
        "name": "Diff",
        "children": [
          {
            "name": "InputShaftCageRatio",
            "tooltip": "This parameter is the transmission ration from differential input shaft to cage"
          },
          {
            "name": "Center",
            "children": [
              {
                "name": "CageInertia",
                "tooltip": "Inertia of the differential cage. This is the center differential in case of a 4WD architecture"
              },
              {
                "name": "CouplingTorque1D",
                "tooltip": "Center differential coupling torque map depending on speed difference (for viscous coupling)"
              },
              {
                "name": "FrictionGradient",
                "tooltip": "Friction Gradient of center differential between friction torque and rotational Speed difference used for numerical stability when switching from stick to slip state"
              },
              {
                "name": "FrontPropellerShaftInertia",
                "tooltip": "Inertia of front propeller shaft for 4WD vehicle architecture towards front differential"
              },
              {
                "name": "FrontPropellerShaftRatio",
                "tooltip": "Transmission ratio between the front propeller shaft and the 4WD differential"
              },
              {
                "name": "FrontRearRatio",
                "tooltip": "Torque distribution between front and rear axle. Specifies how much input torque is transferred to front axle (e.g.: 0.7 = 70% of torque to front axle)"
              },
              {
                "name": "GearRatio2D",
                "tooltip": "This 2D characteristic describes the gear ratio and efficiency for every central differential gear"
              },
              {
                "name": "RearPropellerShaftInertia",
                "tooltip": "Inertia of rear propeller shaft for 4WD vehicle architecture towards rear differential"
              },
              {
                "name": "RearPropellerShaftRatio",
                "tooltip": "Transmission ratio between the rear propeller shaft and the 4WD differential"
              }
            ]
          },
          {
            "name": "Front",
            "children": [
              {
                "name": "CouplingTorque1D",
                "tooltip": "Front differential coupling torque map depending on speed difference (for viscous coupling)"
              },
              {
                "name": "Efficiency",
                "tooltip": "Overall front differential unit's state efficiency"
              },
              {
                "name": "FrictionGradient",
                "tooltip": "Friction Gradient of front differential between friction torque and rotational speed difference used for numerical stability when switching from stick to slip state"
              },
              {
                "name": "Inertia",
                "tooltip": "Overall front differential unit inertia. This is the front cage inertia of a FWD or 4WD"
              },
              {
                "name": "Dragged",
                "children": [
                  {
                    "name": "TorqueBias",
                    "tooltip": "Dragged Torque Bias. Dragged means that this parameter applies to the torque that goes to the input shaft (negative torque, when decelerating)."
                  },
                  {
                    "name": "TorqueBiasWithSlip",
                    "tooltip": "Dragged Torque Bias with Slip. Considering speed difference. (The torque bias ratio changes depending on the output shaft that rotates faster)"
                  }
                ]
              },
              {
                "name": "Driven",
                "children": [
                  {
                    "name": "TorqueBias",
                    "tooltip": "Driven Torque Bias. Driven means that this parameter applies to the torque coming from the input shaft (positive torque)."
                  },
                  {
                    "name": "TorqueBiasWithSlip",
                    "tooltip": "Driven Torque Bias with Slip. Considering speed difference. (The torque bias ratio changes depending on the output shaft tha trotates faster)"
                  }
                ]
              },
              {
                "name": "Left",
                "children": [
                  {
                    "name": "HalfShaft",
                    "children": [
                      {
                        "name": "Damping",
                        "tooltip": "Rotational damping characteristic of the front half shaft."
                      },
                      {
                        "name": "Inertia",
                        "tooltip": "Inertia of half shaft (Front differential to wheel)"
                      },
                      {
                        "name": "Mass",
                        "tooltip": "Front half shaft mass"
                      },
                      {
                        "name": "Stiffness",
                        "tooltip": "Rotational stiffness of the front half shaft"
                      }
                    ]
                  }
                ]
              },
              {
                "name": "Right",
                "children": [
                  {
                    "name": "HalfShaft",
                    "children": [
                      {
                        "name": "Damping",
                        "tooltip": "Rotational damping characteristic of the front half shaft."
                      },
                      {
                        "name": "Stiffness",
                        "tooltip": "Rotational stiffness of the front half shaft"
                      },
                      {
                        "name": "Mass",
                        "tooltip": "Front half shaft mass"
                      },
                      {
                        "name": "Inertia",
                        "tooltip": "Inertia of half shaft (Front differential to wheel)"
                      }
                    ]
                  }
                ]
              },
              {
                "name": "PropellerShaft",
                "children": [
                  {
                    "name": "TorqueVectoringRatio",
                    "tooltip": "Torque vectoring ratio from left to right driveshaft (front axis)"
                  },
                  {
                    "name": "Efficiency",
                    "tooltip": "Overall efficiency of 4WD differential gear (front axle)"
                  }
                ]
              }
            ]
          },
          {
            "name": "HangOn",
            "children": [
              {
                "name": "CouplingTorque1D",
                "tooltip": "1D Characteristic for coupling torque as a function of the rotation speed difference"
              },
              {
                "name": "DisconnectSpeed",
                "tooltip": "Disconnect unit for the rear axle. When the vehicle is dragged and the rotational speed is above the specified value the disconnect unit applies"
              },
              {
                "name": "FrictionGradient",
                "tooltip": "Friction Gradient of hang on differential between friction torque and rotational speed difference used for numerical stability when switching from stick to slip state"
              },
              {
                "name": "InputShaftCageRatio",
                "tooltip": "Transmission ratio between gearbox and hang on differential"
              },
              {
                "name": "InputShaftInertia",
                "tooltip": "Inertia of hang on differential input shaft"
              },
              {
                "name": "OutputShaftInertia",
                "tooltip": "Inertia of hang on differential output shaft"
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "CouplingTorque1D",
                "tooltip": "Rear differential coupling torque map depending on speed difference (for viscous coupling)"
              },
              {
                "name": "FrictionGradient",
                "tooltip": "Friction Gradient of rear differential between friction torque and rotational speed difference used for numerical stability when switching from stick to slip state"
              },
              {
                "name": "Efficiency",
                "tooltip": "Overall rear differential unit's state efficiency"
              },
              {
                "name": "Inertia",
                "tooltip": "Overall rear differential unit inertia. This is the rear cage in case of a RWD or 4WD"
              },
              {
                "name": "Dragged",
                "children": [
                  {
                    "name": "TorqueBias",
                    "tooltip": "Dragged Torque Bias. Dragged means that this parameter applies to the torque that goes to the input shaft (negative torque, when decelerating)."
                  },
                  {
                    "name": "TorqueBiasWithSlip",
                    "tooltip": "Dragged Torque Bias with Slip. Considering speed difference. (The torque bias ratio changes depending on the output shaft that rotates faster)"
                  }
                ]
              },
              {
                "name": "Driven",
                "children": [
                  {
                    "name": "TorqueBiasWithSlip",
                    "tooltip": "Driven Torque Bias with Slip. Considering speed difference. (The torque bias ratio changes depending on the output shaft that rotates faster)"
                  },
                  {
                    "name": "TorqueBias",
                    "tooltip": "Driven Torque Bias. Driven means that this parameter applies to the torque coming from the input shaft (positive torque)."
                  }
                ]
              },
              {
                "name": "Left",
                "children": [
                  {
                    "name": "HalfShaft",
                    "children": [
                      {
                        "name": "Inertia",
                        "tooltip": "Inertia of Half Shaft (Rear differential to wheel)"
                      },
                      {
                        "name": "Damping",
                        "tooltip": "Rotational damping characteristic of the rear half shaft."
                      },
                      {
                        "name": "Stiffness",
                        "tooltip": "Rotational stiffness of the rear half shaft"
                      },
                      {
                        "name": "Mass",
                        "tooltip": "Rear half shaft mass"
                      }
                    ]
                  }
                ]
              },
              {
                "name": "PropellerShaft",
                "children": [
                  {
                    "name": "Efficiency",
                    "tooltip": "Overall efficiency of 4WD differential gear (rear axle)"
                  },
                  {
                    "name": "TorqueVectoringRatio",
                    "tooltip": "Torque vectoring ratio from left to right driveshaft (rear axis)"
                  },
                  {
                    "name": "Inertia",
                    "tooltip": "Inertia of propeller shaft in case of a RWD architecture. This is the inertia from the gearbox shaft out towards the rear differential"
                  }
                ]
              },
              {
                "name": "Right",
                "children": [
                  {
                    "name": "HalfShaft",
                    "children": [
                      {
                        "name": "Damping",
                        "tooltip": "Rotational damping characteristic of the rear half shaft."
                      },
                      {
                        "name": "Mass",
                        "tooltip": "Rear half shaft mass"
                      },
                      {
                        "name": "Inertia",
                        "tooltip": "Inertia of Half Shaft (Rear differential to wheel)"
                      },
                      {
                        "name": "Stiffness",
                        "tooltip": "Rotational stiffness of the rear half shaft"
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "DMF",
        "children": [
          {
            "name": "FrictionCoefficient",
            "tooltip": "Friction coefficient between the spring mass elements and the primary side"
          },
          {
            "name": "Damping",
            "tooltip": "Damping of the dual-mass flywheel spring element"
          },
          {
            "name": "FrictionTorque",
            "tooltip": "Gradient between friction torque and rot. speed difference between shafts. Equivalent to Friction Coefficient"
          },
          {
            "name": "MidRadius",
            "tooltip": "Middle radius of the DMF spring."
          },
          {
            "name": "NumberSprings",
            "tooltip": "Number of pendulum masses inside DMF. These masses aare connected to the arc springs"
          },
          {
            "name": "OuterRadius",
            "tooltip": "Outer radius of the DMF spring."
          },
          {
            "name": "SecondarySideInertia",
            "tooltip": "Overall inertia of the elements that belong to the dual-mass flywheel secondary side. The secondary side is the side that is closer to the gearbox."
          },
          {
            "name": "PrimarySideInertia",
            "tooltip": "Overall inertia of the elements that belong to the dual-mass flywheel primary side. The primary side is the side that is closer to the engine."
          },
          {
            "name": "SpringInertia",
            "tooltip": "Inertia of the DMF spring"
          },
          {
            "name": "Stiffness",
            "tooltip": "Stiffness of the dual-mass flywheel spring element"
          },
          {
            "name": "SpringMass",
            "tooltip": "Mass of the spring inside the dual-mass flywheel"
          }
        ]
      },
      {
        "name": "ImpellerClutch",
        "children": [
          {
            "name": "DisconnectPosition",
            "tooltip": "At this position/signal from TCU the impeller clutch starts transferring torque when closing"
          },
          {
            "name": "Stiffness",
            "tooltip": "This impeller spring stiffness defines the stiffness of the converters impeller clutch to fully decouple the engine"
          }
        ]
      },
      {
        "name": "PlanetaryGear",
        "children": [
          {
            "name": "CarrierGearInertia",
            "tooltip": "Moment of inertia of the carrier gear"
          },
          {
            "name": "Efficiency",
            "tooltip": "Efficiency of the planetary gearbox between the ring and sun gear"
          },
          {
            "name": "RingSunRatio",
            "tooltip": "The ratio between ring gear and the sun gear"
          },
          {
            "name": "RingGearInertia",
            "tooltip": "This is the overall rotating inertia of the ring gear"
          },
          {
            "name": "SunGearInertia",
            "tooltip": "This is the overall rotating inertia of the sun gear"
          }
        ]
      },
      {
        "name": "TCU",
        "children": [
          {
            "name": "LockingSpeed2D",
            "tooltip": "2D Table with gear number and (nUnlock [rpm] / nLock [rpm]). 'nUnlock' and 'nLock' defines the lock-up clutch of the hydraulic converter is opened (converter unlocked) or closed (converter locked)."
          },
          {
            "name": "LockingDelay",
            "tooltip": "Automatic transmission control locking delay"
          },
          {
            "name": "LockingThrottlePosition2D",
            "tooltip": "2D Table with throttle position and (nUnlock [rpm] / nLock [rpm]). 'nUnlock' and 'nLock' defines the lock-up clutch of the hydraulic converter is opened (converter unlocked) or closed (converter locked)."
          },
          {
            "name": "MaxEngineSpeed",
            "tooltip": "Maximum engine speed while manually shifting gears. If this threshold is reached, the vehicle automatically shifts down"
          },
          {
            "name": "MinEngineSpeed",
            "tooltip": "Minimum engine speed while manually shifting gears. If this threshold is reached, the vehicle automatically shifts up"
          },
          {
            "name": "ShiftingSpeed2D",
            "tooltip": "Gear shifting logic with minimal/maximal shifting limits for each gear and engine speed"
          },
          {
            "name": "ShiftTime",
            "tooltip": "Time intervall between gear changes in a transmission"
          },
          {
            "name": "ShiftingThrottlePosition2D",
            "tooltip": "Gear shifting logic with minimal/maximal shifting limits for different throttle positions"
          },
          {
            "name": "SyncTime",
            "tooltip": "The synchronization time specifies the time to close the lock-up clutch and synchronize the rotation speeds of converter input and output side"
          }
        ]
      },
      {
        "name": "GearRatio1D",
        "tooltip": "Table including gear number and ratio"
      },
      {
        "name": "GearRatioReverse",
        "tooltip": "Ratio for the reverse gear. Please upload as a negative value. (E.g.: -3.7)"
      },
      {
        "name": "InputShaftInertia",
        "tooltip": "Overall inertia of the gearbox input shaft"
      },
      {
        "name": "InertiaTensor",
        "tooltip": "Overall inertia of the gearbox input shaft"
      },
      {
        "name": "OutputShaftInertia",
        "tooltip": "Overall inertia output shaft of the gearbox. In a FWD architecture this equals the inertia of the differential input shaft."
      },
      {
        "name": "Mass",
        "tooltip": "Overall mass of the transmission in use including mountings"
      },
      {
        "name": "Position",
        "tooltip": "Position of transmission unit inside the vehicle"
      },
      {
        "name": "SyncTime",
        "tooltip": "The synchronization time specifies the time to synchronize the rotation speeds (input and output shaft during gear change)."
      },
      {
        "name": "Efficiency1D",
        "tooltip": "Efficieny for all gear numbers. If the number of efficiencies are less than the number of gears, the last entry in the table will be applied to all remaining gears."
      },
      {
        "name": "EfficiencyReverse",
        "tooltip": "Efficiency for reverse gear."
      }
    ]
  },
  {
    "name": "VEH",
    "children": [
      {
        "name": "FullOptionCurbWeight",
        "tooltip": "Curb weight of vehicle (full option)"
      },
      {
        "name": "CurbWeight",
        "tooltip": "Curb weight of vehicle"
      },
      {
        "name": "Height",
        "tooltip": "Vehicle height from ground to top point of roof in a 1- Up load configuration"
      },
      {
        "name": "Length",
        "tooltip": "Overall vehicle length"
      },
      {
        "name": "Width",
        "tooltip": "Vehicle width of the vehicle without mirrors"
      },
      {
        "name": "Body",
        "children": [
          {
            "name": "Inertia",
            "tooltip": "Sprung body inertia (Amesim parameter name \"Body MOI\")"
          },
          {
            "name": "InertiaTensor",
            "tooltip": "Sprung body moments of inertia"
          },
          {
            "name": "InertiaProductTensor",
            "tooltip": "Sprung body products of moments of inertia"
          },
          {
            "name": "Mass",
            "tooltip": "Overall sprung body mass of the entire sprung body"
          },
          {
            "name": "Position",
            "tooltip": "Overall position (T L H) of sprung body in vehicle coordinate system"
          },
          {
            "name": "Front",
            "children": [
              {
                "name": "InertiaTensor",
                "tooltip": "Sprung body moments of inertia - front part of the vehicle"
              },
              {
                "name": "InertiaProductTensor",
                "tooltip": "Sprung body products of moments of inertia - front part of the vehicle"
              },
              {
                "name": "Position",
                "tooltip": "Position (T L H) of front frame in vehicle coordinate system"
              },
              {
                "name": "Mass",
                "tooltip": "If the vehicle would consist of a front frame and rear frame only, this is the mass mass of the front frame. (The frame ahead of a likely twist (torsion) point located around mid point of the vehicle chassis)"
              }
            ]
          },
          {
            "name": "Joint",
            "children": [
              {
                "name": "Position",
                "tooltip": "This is a likely twist (torsion) point located around mid point of the vehicle chassis if the vehicle would consist of two sprung bodies, each of both mounted on an individual frame"
              },
              {
                "name": "Bending",
                "children": [
                  {
                    "name": "Damping",
                    "tooltip": "Characteristic damping value for vehicle bending (if the vehicle is split into a rear and front frame, the bending axis would correspond to the middle finger in right hand rule convention)"
                  },
                  {
                    "name": "Stiffness",
                    "tooltip": "Characteristic value for vehicle bending stiffness (if the vehicle is split into a rear and front frame, the bending axis would correspond to the middle finger in right hand rule convention)"
                  }
                ]
              },
              {
                "name": "Torsion",
                "children": [
                  {
                    "name": "Damping",
                    "tooltip": "Characteristic value for vehicle torsional damping (if the vehicle is split into a rear and front frame, the torsional axis would correspond to the index finger in right hand rule convention)"
                  },
                  {
                    "name": "Stiffness",
                    "tooltip": "Characteristic value for vehicle torsional stiffness (if the vehicle is split into a rear and front frame, the torsional axis would correspond to the index finger in right hand rule convention)"
                  }
                ]
              }
            ]
          },
          {
            "name": "Rear",
            "children": [
              {
                "name": "InertiaProductTensor",
                "tooltip": "Sprung body products of moments of inertia - rear part of the vehicle"
              },
              {
                "name": "InertiaTensor",
                "tooltip": "Sprung body moments of inertia - rear part of the vehicle"
              },
              {
                "name": "Mass",
                "tooltip": "If the vehicle would consist of a front frame and rear frame only, this is the mass mass of the rear frame. (The frame behind of a likely twist (torsion) point located around mid point of the vehicle chassis)"
              },
              {
                "name": "Position",
                "tooltip": "Position (T L H) of rear frame in vehicle coordinate sysrtem"
              }
            ]
          }
        ]
      },
      {
        "name": "Driver",
        "children": [
          {
            "name": "HipPointPosition",
            "tooltip": "This is the height of the driver's hip point for COG caluclation"
          },
          {
            "name": "InertiaTensor",
            "tooltip": "Vehicle driver moments of inertia"
          },
          {
            "name": "Mass",
            "tooltip": "Weight of driver"
          },
          {
            "name": "Position",
            "tooltip": "Center of gravity of driver"
          }
        ]
      },
      {
        "name": "Front",
        "children": [
          {
            "name": "CurbWeight",
            "tooltip": "Curb weight of vehicle front axle"
          },
          {
            "name": "Overhang",
            "tooltip": "Horizontal distance between center point front axle to the vehicle front end"
          },
          {
            "name": "FullOptionCurbWeight",
            "tooltip": "Curb weight of vehicle (full option) front axle"
          }
        ]
      },
      {
        "name": "FuelTank",
        "children": [
          {
            "name": "InertiaTensor",
            "tooltip": "Fuel tank moment of inertia along vehicle longitudinal, vehicle and vertical axis"
          },
          {
            "name": "Mass",
            "tooltip": "Fuel tank mass"
          },
          {
            "name": "Position",
            "tooltip": "Fuel tank Position inside the vehicle (T L H position)"
          },
          {
            "name": "Volume",
            "tooltip": "Fuel Tank capacity"
          }
        ]
      },
      {
        "name": "Passenger",
        "children": [
          {
            "name": "InertiaTensor",
            "tooltip": "Passenger moments of inertia"
          },
          {
            "name": "HipPointPosition",
            "tooltip": "This is the height of the passenger's hip point for COG caluclation"
          },
          {
            "name": "Mass",
            "tooltip": "Weight of passenger"
          },
          {
            "name": "Position",
            "tooltip": "Center of gravity of passenger"
          }
        ]
      },
      {
        "name": "Powertrain",
        "children": [
          {
            "name": "Mass",
            "tooltip": "Weight of PT (or PE) (without oil, with motor, A/C comp. and support brackets, etc.)\r\r\n(Amesim paramter name : \"PT (or PE) weight\")"
          }
        ]
      },
      {
        "name": "PowertrainControl",
        "children": [
          {
            "name": "Assist",
            "children": [
              {
                "name": "MinSOC",
                "tooltip": "Lower limit of the Battery SOC to enable Assist strategy"
              },
              {
                "name": "TorqueLimitRange",
                "tooltip": "Transient zone around the upper limit of the target torque to enable Assist strategy"
              },
              {
                "name": "MinSOCRange",
                "tooltip": "Transient zone around the Battery SOC limit to enable Assist strategy"
              }
            ]
          },
          {
            "name": "Boost",
            "children": [
              {
                "name": "MinSOCRange",
                "tooltip": "Transient zone around the Battery SOC limit to enable Boost strategy"
              },
              {
                "name": "MinSOC",
                "tooltip": "Lower limit of the Battery SOC to enable Boost strategy"
              },
              {
                "name": "TorqueLimitRange",
                "tooltip": "Transient zone around the lower limit of the target torque to enable Boost strategy"
              }
            ]
          },
          {
            "name": "Coasting",
            "children": [
              {
                "name": "BrakeLimit",
                "tooltip": "Upper limit of the brake pedal position to enable Coasting strategy"
              },
              {
                "name": "BrakeLimitRange",
                "tooltip": "Transient zone around the upper limit of the brake pedal position to enable Coasting strategy"
              },
              {
                "name": "MinSOC",
                "tooltip": "Lower limit of the Battery SOC to enable Coasting strategy"
              },
              {
                "name": "GasLimit",
                "tooltip": "Upper limit of the gas pedal position to enable Coasting strategy"
              },
              {
                "name": "GasLimitRange",
                "tooltip": "Transient zone around the upper limit of the gas pedal position to enable Coasting strategy"
              },
              {
                "name": "MinSOCRange",
                "tooltip": "Transient zone around the Battery SOC limit to enable Costing strategy"
              },
              {
                "name": "SpeedLimit",
                "tooltip": "Upper limit of the vehicle speed to enable Coasting strategy"
              }
            ]
          },
          {
            "name": "ElectricDriving",
            "children": [
              {
                "name": "MinSOC",
                "tooltip": "Lower limit of the Battery SOC to enable Electric Driving strategy"
              },
              {
                "name": "SpeedLimitRange",
                "tooltip": "Transient zone around the upper limit of the vehicle speed to enable Electric Driving strategy"
              },
              {
                "name": "SpeedLimit",
                "tooltip": "Upper limit of the vehicle speed to enable Electric Driving strategy"
              },
              {
                "name": "MinSOCRange",
                "tooltip": "Transient zone around the Battery SOC limit to enable Electric Driving strategy"
              },
              {
                "name": "TorqueFactorIn",
                "tooltip": "Part of maximum electric motor torque for target torque lower limit for switching to strategy Electric Driving"
              },
              {
                "name": "TorqueFactorOut",
                "tooltip": "Part of maximum electric motor torque for target torque upper limit for staying in strategy Electric Driving"
              }
            ]
          },
          {
            "name": "GasInterpreter",
            "children": [
              {
                "name": "MaxTorque",
                "tooltip": "Maximum torque demand at full gas pedal actuation. Equal to ENG.MaxTorque for ICE Powertrains."
              },
              {
                "name": "MinTorque",
                "tooltip": "Minimum torque demand at no gas pedal actuation."
              }
            ]
          },
          {
            "name": "LoadShifting",
            "children": [
              {
                "name": "MaxSOC",
                "tooltip": "Upper limit of the battery SOC to enable Load Shifting strategy"
              },
              {
                "name": "MaxSOCRange",
                "tooltip": "Transient zone around the upper limit of the battery SOC to enable Load Shifting"
              },
              {
                "name": "TorqueLimitRange",
                "tooltip": "Width of the transient zone around target torque upper limit for Load Shifting strategy"
              }
            ]
          },
          {
            "name": "RegenBraking",
            "children": [
              {
                "name": "MaxSOCRange",
                "tooltip": "Transient Zone around the battery SOC limit to enable Regenerative Braking strategy"
              },
              {
                "name": "MaxSOC",
                "tooltip": "Upper limit of the battery SOC to enable Regenerative Braking"
              },
              {
                "name": "TorqueLimit",
                "tooltip": "Lower limit of the target regen torque per wheel for Regenerative Braking strategy"
              },
              {
                "name": "SpeedLimit",
                "tooltip": "Lower limit of the vehicle speed to enable Regenerative Braking strategy"
              }
            ]
          },
          {
            "name": "RegenDrag",
            "children": [
              {
                "name": "MaxSOC",
                "tooltip": "Upper limit of the battery SOC to enable Regenerative Drag strategy"
              },
              {
                "name": "MaxSOCRange",
                "tooltip": "Transient zone around the upper limit of the battery SOC to enable Regenerative Drag"
              },
              {
                "name": "SpeedLimit",
                "tooltip": "Lower limit of the vehicle speed to enable Regenerative Drag strategy"
              },
              {
                "name": "TorqueLimit",
                "tooltip": "Upper limit of the negative target torque for staying in Regenerative Drag mode"
              }
            ]
          },
          {
            "name": "StartStop",
            "children": [
              {
                "name": "BrakeLimit",
                "tooltip": "Lower limit of the brake pedal position to enable StartStop"
              },
              {
                "name": "BrakeLimitRange",
                "tooltip": "Transient zone around the lower limit of the brake pedal position to enable StartStop"
              },
              {
                "name": "ClutchLimit",
                "tooltip": "Lower limit of the clutch pedal position to enable StartStop"
              },
              {
                "name": "ClutchLimitRange",
                "tooltip": "Transient zone around the lower limit of the clutch pedal position to enable StartStop"
              },
              {
                "name": "GasLimit",
                "tooltip": "Lower limit of the gas pedal position to enable StartStop"
              },
              {
                "name": "GasLimitRange",
                "tooltip": "Transient Zone around the lower limit of the gas pedal position to enable StartStop"
              },
              {
                "name": "MinSOC",
                "tooltip": "Lower limit of the Battery SOC to enable StartStop strategy"
              },
              {
                "name": "MinSOCRange",
                "tooltip": "Transient zone around the Battery SOC limit to enable StartStop strategy"
              },
              {
                "name": "SpeedLimit",
                "tooltip": "Upper limit of the vehicle speed to enable StartStop strategy"
              }
            ]
          }
        ]
      },
      {
        "name": "Rear",
        "children": [
          {
            "name": "CurbWeight",
            "tooltip": "Curb weight of vehicle rear axle"
          },
          {
            "name": "FullOptionCurbWeight",
            "tooltip": "Curb weight of vehicle (full option) rear axle"
          },
          {
            "name": "Overhang",
            "tooltip": "Horizontal distance between center point rear axle to the vehicle back end"
          }
        ]
      },
      {
        "name": "RoofLoad",
        "children": [
          {
            "name": "InertiaTensor",
            "tooltip": "Moments of inertia of roof load"
          },
          {
            "name": "Mass",
            "tooltip": "Load on top of vehicle roof"
          },
          {
            "name": "Position",
            "tooltip": "Center of gravity of roof load"
          }
        ]
      },
      {
        "name": "TrimLoad25",
        "children": [
          {
            "name": "InertiaTensor",
            "tooltip": "Moments of inertia of trim load (25kg)"
          },
          {
            "name": "Mass",
            "tooltip": "Exemplary trim load (25kg)"
          },
          {
            "name": "Position",
            "tooltip": "Center of gravity of trim load (25kg)"
          }
        ]
      },
      {
        "name": "TrimLoad50",
        "children": [
          {
            "name": "Mass",
            "tooltip": "Exemplary trim load (50kg)"
          },
          {
            "name": "InertiaTensor",
            "tooltip": "Moments of inertia of trim load (50kg)"
          },
          {
            "name": "Position",
            "tooltip": "Center of gravity of trim load (50kg)"
          }
        ]
      },
      {
        "name": "TrimLoad75",
        "children": [
          {
            "name": "InertiaTensor",
            "tooltip": "Moments of inertia of trim load (75kg)"
          },
          {
            "name": "Position",
            "tooltip": "Center of gravity of trim load (75kg)"
          },
          {
            "name": "Mass",
            "tooltip": "Exemplary trim load (75kg)"
          }
        ]
      },
      {
        "name": "TrunkLoad",
        "children": [
          {
            "name": "Mass",
            "tooltip": "Vehicle trunk load"
          },
          {
            "name": "InertiaTensor",
            "tooltip": "Moments of inertia of trunk load"
          },
          {
            "name": "Position",
            "tooltip": "Center of gravity of trunk load"
          }
        ]
      }
    ]
  }
]
